[{"id": 18622,"commandid" : 2462,"title": "Name","page": "lsof - list open files"},{"id": 18623,"commandid" : 2462,"title": "Synopsis","page": "lsof [ -?abChlnNOPRtUvVX ] [ -A -c +c+|-d +|-D +|-e +|-f [cfgGn] ] [ -F -g[s]-i -k +|-L +|-m +|-M ] [ -o -p+|-r -s -S -T -u +|-w ] [ -x -z -Z -- ] ["},{"id": 18624,"commandid" : 2462,"title": "Description","page": "<br><br><br>   DISTRIBUTION section of this manual page for information on how to obtain the latest <br><br>An open file may be a regular file, a directory, a block special file, a character special file, an executing text reference, a library, a stream or anetwork file (Internet socket, NFS file or UNIX domain socket.) A specific file or all the files in a file system may be selected by path.<br><br>Instead of a formatted display, lsof will produce output that can be parsed by other programs. See the <b>-F</b>, option description, and the<b>OUTPUT FOR OTHER PROGRAMS</b> section for more information.<br><br>In addition to producing a single output list, lsof will run in repeat mode. In repeat mode it will produce output, delay, then repeat theoutput operation until stopped with an interrupt or quit signal. See the <b>+|-r</b> [t[m&lt;fmt&gt;]] option description for more information."},{"id": 18625,"commandid" : 2462,"title": "Options","page": "<br><br>If any list request option is specified, other list requests must be specifically requested - e.g., if <b>-U</b> is specified for the listing of UNIXsocket files, NFS files wont be listed unless <b>-N</b> is also specified; or if a user list is specified with the <b>-u</b> option, UNIX domain socket files,belonging to users not in the list, wont be listed unless the <b>-U</b> option is also specified.<br><br>Normally list options that are specifically stated are ORed - i.e., specifying the <b>-i</b> option without an address and the <b>-u</b>foo optionproduces a listing of all network files OR files belonging to processes owned by user foo. The exceptions are:-u option;-p option;-g option;-c option;-s <br><br>Since they represent exclusions, they are applied without ORing or ANDing and take effect before any other selection criteria are applied.<br><br>The <b>-a</b> option may be used to AND the selections. For example, specifying <b>-a</b>, <b>-U</b>, and <b>-u</b>foo produces a listing of only UNIXsocket files that belong to processes owned by user foo.<br><br>Caution: the <b>-a</b> option causes all list selection options to be ANDed; it cant be used to cause ANDing of selected pairs of selection optionsby placing it between them, even though its placement there is acceptable. Wherever <b>-a</b> is placed, it causes the ANDing of all selection options.<br><br>Items of the same selection set - command names, file descriptors, network addresses, process identifiers, user identifiers, zone names, securitycontexts - are joined in a single ORed set and applied before the result participates in ANDing. Thus, for example, specifying <b>-i</b>@aaa.bbb,<b>-i</b>@ccc.ddd, <b>-a</b>, and <b>-u</b>fff,ggg will select the listing of files that belong to either login fff OR ggg AND have network connectionsto either host aaa.bbb OR ccc.ddd.<br><br>Options may be grouped together following a single prefix -- e.g., the option set <b>-a -b -C</b> may be stated as <b>-abC</b>. However, sincevalues are optional following <b>+|-f</b>, <b>-F</b>, <b>-g</b>, <b>-i</b>, <b>+|-L</b>, <b>-o</b>, <b>+|-r</b>, <b>-s</b>, <b>-S</b>, <b>-T</b>, <b>-x</b> and<b>-z</b>. when you have no values for them be careful that the following character isnt ambiguous. For example, <b>-Fn</b> might represent the <b>-F</b> and<b>-n</b> options, or it might represent the <b>n</b> field identifier character following the <b>-F</b> option. When ambiguity is possible, start a new optionwith a - character - e.g., <b>-F -n</b>. If the next option is a file name, follow the possibly ambiguous option with -- - e.g., <b>-F name</b>.<br><br>Either the + or the - prefix may be applied to a group of options. Options that dont take on separate meanings for each prefix - e.g., <b>-i</b>- may be grouped under either prefix. Thus, for example, +M -i may be stated as +Mi and the group means the same as the separate options. Be careful ofprefix grouping when one or more options in the group does take on separate meanings under different prefixes - e.g., <b>+|-M</b>; -iM is not the samerequest as -i +M. When in doubt, use separate options with appropriate prefixes.-? -hThese two equivalent options select a usage (help) output list. Lsof displays a shortened form of this output when it detects an error in theoptions supplied to it, after it has displayed messages explaining each error. (Escape the ? character as your shell requires.)-aThis option causes list selection options to be ANDed, as described above.-A This option is available on systems configured for AFS whose AFS kernel code is implemented via dynamic modules. It allows the lsof user tospecify A as an alternate name list file where the kernel addresses of the dynamic modules might be found. See the lsof FAQ (The <b>FAQ</b>section gives its location.) for more information about dynamic modules, their symbols, and how they affect lsof.-bThis option causes lsof to avoid kernel functions that might block - <b><a href=/man/2/lstat>lstat</a></b>(2), <b><a href=/man/2/readlink>readlink</a></b>(2), and <b><a href=/man/2/stat>stat</a></b>(2).See the<b>BLOCKS AND TIMEOUTS</b> and <b>AVOIDING KERNEL BLOCKS</b> sections for information on using this option.-ccThis option selects the listing of files for processes executing the command that begins with the characters of c. Multiple commands may bespecified, using multiple <b>-c</b> options. They are joined in a single ORed set before participating in AND option selection.Ifc begins with a ^, then the following characters specify a command name whose processes are to be ignored (excluded.)Ifc begins and ends with a slash (/), the characters between the slashes are interpreted as a regular expression. Shell meta-characters in theregular expression must be quoted to prevent their interpretation by the shell. The closing slash may be followed by these modifiers:<br>   b    the regular expression is a basic one.    i    ignore the case of letters.    x    the regular expression is an extended one        (default).See the lsof FAQ (The <b>FAQ</b> section gives its location.) for more information on basic and extended regular expressions.The simple command specification is tested first.If that test fails, the command regular expression is applied. If the simple command test succeeds, the command regular expression test isnt made. Thismay result in no command found for regex: messages when lsofs <b>-V</b> option is specified.+c This option defines the maximum number of initial characters of the name, supplied by the UNIX dialect, of the UNIX command associated with a process to beprinted in the COMMAND column. (The lsof default is nine.)Note that many UNIX dialects do not supply all command name charactersto lsof in the files and structures from which lsof obtains command name. Often dialects limit the number of characters supplied in thosesources. For example, Linux 2.4.27 and Solaris 9 both limit command name length to 16 characters.Ifw is zero (0), all command characters supplied to lsof by the UNIX dialect will be printed.Ifw is less than the length of the column title, COMMAND, it will be raised to that length.-CThis option disables the reporting of any path name components from the kernels name cache. See the <b>KERNEL NAME CACHE</b> section for more information.+d This option causes lsof to search for all open instances of directory s and the files and directories it contains at its top level. Thisoption does NOT descend the directory tree, rooted at s. The <b>+D</b> D option may be used to request a full-descent directory tree search,rooted at directory D.Processing of the<b>+d</b> option does not follow symbolic links within s unless the <b>-x</b> or <b>-x  l</b> option is also specified. Nor does it search foropen files on file system mount points on subdirectories of s unless the <b>-x</b> or <b>-x  f</b> option is also specified.Note: the authority of the user of this option limits it to searching forfiles that the user has permission to examine with the system <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) function.-d This option specifies a list of file descriptors (FDs) to exclude from or include in the output listing. The file descriptors are specified in thecomma-separated set s - e.g., cwd,1,3, ^6,^2. (There should be no spaces in the set.)The list is an exclusion list if all entries of the set begin with ^.It is an inclusion list if no entry begins with ^. Mixed lists are not permitted.A file descriptor number range may be in the set as long asneither member is empty, both members are numbers, and the ending member is larger than the starting one - e.g., 0-7 or 3-10. Ranges may bespecified for exclusion if they have the ^ prefix - e.g., ^0-7 excludes all file descriptors 0 through 7.Multiple file descriptor numbers are joined in a single ORed set beforeparticipating in AND option selection.When there are exclusion and inclusion members in the set,lsof reports them as errors and exits with a non-zero return code.See the description of File Descriptor (FD) output values in the<b>OUTPUT</b> section for more information on file descriptor names.+D This option causes lsof to search for all open instances of directory D and all the files and directories it contains to its complete depth.Processing of the<b>+D</b> option does not follow symbolic links within D unless the <b>-x</b> or <b>-x  l</b> option is also specified. Nor does it search foropen files on file system mount points on subdirectories of D unless the <b>-x</b> or <b>-x  f</b> option is also specified.Note: the authority of the user of this option limits it to searching forfiles that the user has permission to examine with the system <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) function.Further note:lsof may process this option slowly and require a large amount of dynamic memory to do it. This is because it must descend the entire directorytree, rooted at D, calling <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) for each file and directory, building a list of all the files it finds, and searching that list for a matchwith every open file. When directory D is large, these steps can take a long time, so use this option prudently.-D This option directs lsofs use of the device cache file. The use of this option is sometimes restricted. See the <b>DEVICE CACHE FILE</b> sectionand the sections that follow it for more information on this option.-Dmust be followed by a function letter; the function letter may optionally be followed by a path name. Lsof recognizes these function letters:<br>   ? - report device cache file paths    b - build the device cache file    i - ignore the device cache file    r - read thedevice cache file    u - read and update the device cache fileThe <b>b</b>, <b>r</b>, and <b>u</b> functions, accompanied by a path name, are sometimes restricted. When these functions are restricted, they will notappear in the description of the <b>-D</b> option that accompanies <b>-h</b> or <b>-?</b> option output. See the <b>DEVICE CACHE FILE</b> section and thesections that follow it for more information on these functions and when theyre restricted.The<b>?</b> function reports the read-only and write paths that lsof can use for the device cache file, the names of any environment variables whose valueslsof will examine when forming the device cache file path, and the format for the personal device cache file path. (Escape the ? character as yourshell requires.)When available, the<b>b</b>, <b>r</b>, and <b>u</b> functions may be followed by the device cache files path. The standard default is .lsof_hostname in the homedirectory of the real user ID that executes lsof, but this could have been changed when lsof was configured and compiled. (The output of the<b>-h</b> and <b>-?</b> options show the current default prefix - e.g., .lsof.) The suffix, hostname, is the first component of the hosts namereturned by <b><a href=/man/2/gethostname>gethostname</a></b>(2).When available, the<b>b</b> function directs lsof to build a new device cache file at the default or specified path.The<b>i</b> function directs lsof to ignore the default device cache file and obtain its information about devices via direct calls to the kernel.The<b>r</b> function directs lsof to read the device cache at the default or specified path, but prevents it from creating a new device cache file whennone exists or the existing one is improperly structured. The <b>r</b> function, when specified without a path name, prevents lsof from updating anincorrect or outdated device cache file, or creating a new one in its place. The <b>r</b> function is always available when it is specified without a path nameargument; it may be restricted by the permissions of the lsof process.When available, the<b>u</b> function directs lsof to read the device cache file at the default or specified path, if possible, and to rebuild it, if necessary. This isthe default device cache file function when no <b>-D</b> option has been specified.+|-e exempts the file system whose path name is s from being subjected to kernel function calls that might block. The <b>+e</b> option exempts<b><a href=/man/2/stat rel=nofollow>stat</a></b>(2), <b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2) and most <b><a href=/man/2/readlink rel=nofollow>readlink</a></b>(2) kernel function calls. The <b>-e</b> option exempts only <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) and <b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2) kernelfunction calls. Multiple file systems may be specified with separate <b>+|-e</b> specifications and each may have <b><a href=/man/2/readlink rel=nofollow>readlink</a></b>(2) calls exempted or not.This option is currently implemented only for Linux.CAUTION:this option can easily be mis-applied to other than the file system of interest, because it uses path name rather than the more reliable device and inodenumbers. (Device and inode numbers are acquired via the potentially blocking <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) kernel call and are thus not available, but see the <b>+|-m</b>m option as a possible alternative way to supply device numbers.)Use this option with great care and fully specify the path name of thefile system to be exempted. Consider, for example, that specifying -e / would exempt all file systems, since all their paths begin with a /.When open files on exempted file systems are reported, it is notpossible to obtain all their information. Therefore, some information columns will be blank, the characters UNKN preface the values in the TYPE column,and the applicable exemption option is added in parentheses to the end of the NAME column. Some device number information might be made available via the<b>+|-m</b> m option.+|-f [cfgGn]<b>f</b> by itself clarifies how path name arguments are to be interpreted. When followed by <b>c</b>, <b>f</b>, <b>g</b>, <b>G</b>, or <b>n</b> in anycombination it specifies that the listing of kernel file structure information is to be enabled (+) or inhibited (-).Normally a path name argument is taken to be a file system name ifit matches a mounted-on directory name reported by <b><a href=mount>mount</a></b>(8), or if it represents a block device, named in the mount output and associatedwith a mounted directory name. When <b>+f</b> is specified, all path name arguments will be taken to be file system names, and lsof will complain if anyare not. This can be useful, for example, when the file system name (mounted-on device) isnt a block device. This happens for some CD-ROM file systems.When<b>-f</b> is specified by itself, all path name arguments will be taken to be simple files. Thus, for example, the <b>-f</b> -- / arguments direct lsofto search for open files with a / path name, not all open files in the / (root) file system.Be careful to make sure<b>+f</b> and <b>-f</b> are properly terminated and arent followed by a character (e.g., of the file or file system name) that might be taken as aparameter. For example, use -- after <b>+f</b> and <b>-f</b> as in these examples.<br>   $ lsof +f -- /file/system/name    $ lsof -f -- /file/nameThe listing of information from kernel file structures, requested with the <b>+f [cfgGn]</b> option form, is normally inhibited, and is not available inwhole or part for some dialects - e.g., /proc-based Linux kernels below 2.6.22. When the prefix to <b>f</b> is a plus sign (+), these characters request filestructure information:<br>   c    file structure use count (not Linux)    f    file structure address (not Linux)    g    file flag abbreviations (Linux 2.6.22and up)    G    file flags in hexadecimal (Linux 2.6.22 and up)    n    file structure node address (not Linux)When the prefix is minus (-) the same characters disable the listing of the indicated values.File structure addresses, use counts, flags, and node addresses may beused to detect more readily identical files inherited by child processes and identical files in use by different processes. Lsof column output canbe sorted by output columns holding the values and listed to identify identical file use, or lsof field output can be parsed by an AWK or Perlpost-filter script, or by a C program.-F This option specifies a character list, f, that selects the fields to be output for processing by another program, and the character that terminateseach output field. Each field to be output is specified with a single character in f. The field terminator defaults to NL, but may be changed to NUL(000). See the <b>OUTPUT FOR OTHER PROGRAMS</b> section for a description of the field identification characters and the field output process.When the field selection character list is empty, all standard fields areselected (except the raw device field, security context and zone field for compatibility reasons) and the NL field terminator is used.When the field selection character list contains only a zero (0),all fields are selected (except the raw device field for compatibility reasons) and the NUL terminator character is used.Other combinations of fields and their associated field terminatorcharacter must be set with explicit entries in f, as described in the <b>OUTPUT FOR OTHER PROGRAMS</b> section.When a field selection character identifies an itemlsof does not normally list - e.g., PPID, selected with <b>-R</b> - specification of the field character - e.g., <b>-FR</b> - also selects thelisting of the item.When the field selection character list contains the singlecharacter ?, lsof will display a help list of the field identification characters. (Escape the ? character as your shell requires.)-g This option excludes or selects the listing of files for the processes whose optional process group IDentification (PGID) numbers are in thecomma-separated set s - e.g., 123 or 123,^456. (There should be no spaces in the set.)PGID numbers that begin with ^ (negation) represent exclusions.in AND option selection. However, PGID exclusions are applied without ORing or ANDing and take effect before other selection criteria are applied.The<b>-g</b> option also enables the output display of PGID numbers. When specified without a PGID set thats all it does.-i This option selects the listing of files any of whose Internet address matches the address specified in i. If no address is specified, this optionselects the listing of all Internet and x.25 (HP-UX) network files.If<b>-i</b>4 or <b>-i</b>6 is specified with no following address, only files of the indicated IP version, IPv4 or IPv6, are displayed. (AnIPv6 specification may be used only if the dialects supports IPv6, as indicated by [46] and IPv[46] in lsofs <b>-h</b> or <b>-?</b> output.)Sequentially specifying <b>-i</b>4, followed by <b>-i</b>6 is the same as specifying <b>-i</b>, and vice-versa. Specifying <b>-i</b>4, or <b>-i</b>6 after<b>-i</b> is the same as specifying <b>-i</b>4 or <b>-i</b>6 by itself.Multiple addresses (up to a limit of 100) may be specified with multiple<b>-i</b> options. (A port number or service name range is counted as one address.) They are joined in a single ORed set before participating in AND optionselection.An Internet address is specified in the form (Items in squarebrackets are optional.):[46 specifies the IP version, IPv4 or IPv6that applies to the following address.6 may be be specified only if the UNIXdialect supports IPv6.  If neither 4 nor6 is specified, the following addressapplies to all IP versions.protocol is a protocol name - TCP, UDPhostname is an Internet host name.  Unless aspecific IP version is specified, opennetwork files associated with host namesof all versions will be selected.hostaddr is a numeric Internet IPv4 address indot form; or an IPv6 numeric address incolon form, enclosed in brackets, if theUNIX dialect supports IPv6.  When an IPversion is selected, only its numericaddresses may be specified.service is an /etc/services name - e.g., smtp or a list of them.port is a port number, or a list of them.IPv6 options may be used only if the UNIX dialect supports IPv6.To see if the dialect supports IPv6, run lsof and specify the <b>-h</b> or <b>-?</b> (help) option. If the displayed description of the <b>-i</b>option contains [46] and IPv[46], IPv6 is supported.IPv4 host names and addresses may not be specified if network file selectionis limited to IPv6 with <b>-i</b> 6. IPv6 host names and addresses may not be specified if network file selection is limited to IPv4 with <b>-i</b> 4. Whenan open IPv4 network files address is mapped in an IPv6 address, the open files type will be IPv6, not IPv4, and its display will be selected by 6, not4.At least one address component <b>4, 6,</b> protocol, ,IR hostname , hostaddr, or service - must be supplied. The @ character, leading the hostspecification, is always required; as is the :, leading the port specification. Specify either hostname or hostaddr. Specify eitherservice name list or port number list. If a service name list is specified, the protocol may also need to be specified if the TCP,UDP and UDPLITE port numbers for the service name are different. Use any case - lower or upper - for protocol.Servicenames and port numbers may be combined in a list whose entries are separated by commas and whose numeric range entries are separated by minus signs.There may be no embedded spaces, and all service names must belong to the specified protocol. Since service names may contain embedded minus signs, thestarting entry of a range cant be a service name; it can be a port number, however.Here are some sample addresses:-i6 - IPv6 onlyTCP:25 - TCP and port 25@1.2.3.4 - Internet IPv4 host address 1.2.3.4@[3ffe:1ebc::1]:1234 - Internet IPv6 host address3ffe:1ebc::1, port 1234UDP:who - UDP who service portTCP@lsof.itap:513 - TCP, port 513 and host name lsof.itaptcp@foo:1-10,smtp,99 - TCP, ports 1 through 10,service name smtp, port 99, host name footcp@bar:1-smtp - TCP, ports 1 through smtp, host bar:time - either TCP, UDP or UDPLITE time service port-k This option specifies a kernel name list file, k, in place of /vmunix, /mach, etc. This option is not available under AIX on the IBM RISC/System6000.-lThis option inhibits the conversion of user ID numbers to login names. It is also useful when login name lookup is working improperly or slowly.+|-L This option enables (+) or disables (-) the listing of file link counts, where they are available - e.g., they arent available for sockets, or mostFIFOs and pipes.When<b>+L</b> is specified without a following number, all link counts will be listed. When <b>-L</b> is specified (the default), no link counts will belisted.When<b>+L</b> is followed by a number, only files having a link count less than that number will be listed. (No number may follow <b>-L</b>.) A specificationof the form <b>+L1</b> will select open files that have been unlinked. A specification of the form <b>+aL1 &lt;file_system&gt;</b> will selectunlinked open files on the specified file system.For other link count comparisons, use field output (-F)and a post-processing script or program.+|-m This option specifies an alternate kernel memory file or activates mount table supplement processing.The option form<b>-m</b> m specifies a kernel memory file, m, in place of /dev/kmem or /dev/mem - e.g., a crash dump file.The option form<b>+m</b> requests that a mount supplement file be written to the standard output file. All other options are silently ignored.There will be a line in the mount supplement file for each mounted filesystem, containing the mounted file system directory, followed by a single space, followed by the device number in hexadecimal 0x format - e.g.,<br>   / 0x801Lsof can use the mount supplement file to get device numbers for file systems when it cant get them via <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) or <b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2).The option form<b>+m</b> m identifies m as a mount supplement file.Note: the<b>+m</b> and <b>+m</b> m options are not available for all supported dialects. Check the output of lsofs <b>-h</b> or <b>-?</b> options tosee if the <b>+m</b> and <b>+m</b> m options are available.+|-MEnables (<b>+</b>) or disables (<b>-</b>) the reporting of portmapper registrations for local TCP, UDP and UDPLITE ports. The default reporting mode is setby the lsof builder with the HASPMAPENABLED #define in the dialects machine.h header file; lsof is distributed with the HASPMAPENABLED #definedeactivated, so portmapper reporting is disabled by default and must be requested with <b>+M</b>. Specifying lsofs <b>-h</b> or <b>-?</b> option willreport the default mode. Disabling portmapper registration when it is already disabled or enabling it when already enabled is acceptable.When portmapper registration reporting is enabled,lsof displays the portmapper registration (if any) for local TCP, UDP or UDPLITE ports in square brackets immediately following the port numbers orservice names - e.g., :1234[name] or :name[100083]. The registration information may be a name or number, depending on what the registering programsupplied to the portmapper when it registered the port.When portmapper registration reporting is enabled,lsof may run a little more slowly or even become blocked when access to the portmapper becomes congested or stopped. Reverse the reporting mode todetermine if portmapper registration reporting is slowing or blocking lsof.For purposes of portmapper registration reportinglsof considers a TCP, UDP or UDPLITE port local if: it is found in the local part of its containing kernel structure; or if it is located in theforeign part of its containing kernel structure and the local and foreign Internet addresses are the same; or if it is located in the foreign part of itscontaining kernel structure and the foreign Internet address is INADDR_LOOPBACK (127.0.0.1). This rule may make lsof ignore some foreign ports onmachines with multiple interfaces when the foreign Internet address is on a different interface from the local one.See thelsof FAQ (The <b>FAQ</b> section gives its location.) for further discussion of portmapper registration reporting issues.-nThis option inhibits the conversion of network numbers to host names for network files. Inhibiting conversion may make lsof run faster. It is alsouseful when host name lookup is not working properly.-NThis option selects the listing of NFS files.-oThis option directs lsof to display file offset at all times. It causes the SIZE/OFF output column title to be changed to OFFSET. Note: on some UNIXdialects lsof cant obtain accurate or consistent file offset information from its kernel data sources, sometimes just for particular kinds of files(e.g., socket files.) Consult the lsof FAQ (The <b>FAQ</b> section gives its location.) for more information.The<b>-o</b> and <b>-s</b> options are mutually exclusive; they cant both be specified. When neither is specified, lsof displays whatever value - sizeor offset - is appropriate and available for the type of the file.-o This option defines the number of decimal digits (o) to be printed after the 0t for a file offset before the form is switched to 0x.... Ano value of zero (unlimited) directs lsof to use the 0t form for all offset output.This option does NOT directlsof to display offset at all times; specify <b>-o</b> (without a trailing number) to do that. This option only specifies the number of digits after0t in either mixed size and offset or offset-only output. Thus, for example, to direct lsof to display offset at all times with a decimal digitcount of 10, use:<br>   -o -o 10or    -oo10The default number of digits allowed after 0t is normally 8, but may have been changed by the lsof builder. Consult the description of the <b>-o</b>o option in the output of the <b>-h</b> or <b>-?</b> option to determine the default that is in effect.-OThis option directs lsof to bypass the strategy it uses to avoid being blocked by some kernel operations - i.e., doing them in forked childprocesses. See the <b>BLOCKS AND TIMEOUTS</b> and <b>AVOIDING KERNEL BLOCKS</b> sections for more information on kernel operations that may block lsof.While use of this option will reducelsof startup overhead, it may also cause lsof to hang when the kernel doesnt respond to a function. Use this option cautiously.-p This option excludes or selects the listing of files for the processes whose optional process IDentification (PID) numbers are in the comma-separated sets - e.g., 123 or 123,^456. (There should be no spaces in the set.)PID numbers that begin with ^ (negation) represent exclusions.participating in AND option selection. However, PID exclusions are applied without ORing or ANDing and take effect before other selection criteria areapplied.-PThis option inhibits the conversion of port numbers to port names for network files. Inhibiting the conversion may make lsof run a little faster. Itis also useful when port name lookup is not working properly.+|-r This option puts lsof in repeat mode. There lsof lists open files as selected by other options, delays t seconds (default fifteen),then repeats the listing, delaying and listing repetitively until stopped by a condition defined by the prefix to the option.If the prefix is a -, repeat mode is endless.Lsof must be terminated with an interrupt or quit signal.If the prefix is +, repeat mode will end the first cycle no open filesare listed - and of course when lsof is stopped with an interrupt or quit signal. When repeat mode ends because no files are listed, the processexit code will be zero if any open files were ever listed; one, if none were ever listed.Lsofmarks the end of each listing: if field output is in progress (the <b>-F</b>, option has been specified), the default marker is m; otherwise the defaultmarker is ========. The marker is followed by a NL character.The optional m<fmt> argument specifies a format for the marker line.The &lt;fmt&gt; characters following m are interpreted as a format specification to the <b><a href=/man/3/strftime>strftime</a></b>(3) function, when both it and the<b><a href=/man/3/localtime>localtime</a></b>(3) function are available in the dialects C library. Consult the <b><a href=/man/3/strftime rel=nofollow>strftime</a></b>(3) documentation for what may appear in its formatspecification. Note that when field output is requested with the <b>-F</b> option, &lt;fmt&gt; cannot contain the NL format, %n. Note also that when&lt;fmt&gt; contains spaces or other characters that affect the shells interpretation of arguments, &lt;fmt&gt; must be quoted appropriately.Repeat mode reduceslsof startup overhead, so it is more efficient to use this mode than to call lsof repetitively from a shell script, for example.To use repeat mode most efficiently, accompany<b>+|-r</b> with specification of other lsof selection options, so the amount of kernel memory access lsof does will be kept to a minimum.Options that filter at the process level - e.g., <b>-c</b>, <b>-g</b>, <b>-p</b>, <b>-u</b> - are the most efficient selectors.Repeat mode is useful when coupled with field output (see the<b>-F</b>, option description) and a supervising awk or Perl script, or a C program.-RThis option directs lsof to list the Parent Process IDentification number in the PPID column.-s <b>s</b> alone directs lsof to display file size at all times. It causes the SIZE/OFF output column title to be changed to SIZE. If the file doesnot have a size, nothing is displayed.When followed by a protocol a colon (:) and a comma-separated protocol state name list, the option causes open TCP and UDP files to be excluded if their state <b>name</b>(s) are in thelist (s) preceded by a ^; or included if their <b>name</b>(s) are not preceded by a ^.When an inclusion list is defined, only network files with statenames in the list will be present in the lsof output. Thus, specifying one state name means that only network files with that lone state name willbe listed.Case is unimportant in the protocol or state names, but there maybe no spaces and the colon (:) separating the protocol name (p) and the state name list (s) is required.If only TCP and UDP files are to be listed, as controlled bythe specified exclusions and inclusions, the <b>-i</b> option must be specified, too. If only a single protocols files are to be listed, add its name asan argument to the <b>-i</b> option.For example, to list only network files with TCP state LISTEN, use:<br>   -iTCP -sTCP:LISTENOr, for example, to list network files with all UDP states except Idle, use:<br>   -iUDP -sUDP:IdleState names vary with UNIX dialects, so its not possible to provide a complete list. Some common TCP state names are: CLOSED, IDLE, BOUND, LISTEN,ESTABLISHED, SYN_SENT, SYN_RCDV, ESTABLISHED, CLOSE_WAIT, FIN_WAIT1, CLOSING, LAST_ACK, FIN_WAIT_2, and TIME_WAIT. Two common UDP state names are Unbound andIdle.See thelsof FAQ (The <b>FAQ</b> section gives its location.) for more information on how to use protocol state exclusion and inclusion, including examples.The<b>-o</b> (without a following decimal digit count) and <b>-s</b> option (without a following protocol and state name list) are mutually exclusive; theycant both be specified. When neither is specified, lsof displays whatever value - size or offset - is appropriate and available for the type of file.Since some types of files dont have true sizes - sockets, FIFOs,pipes, etc. - lsof displays for their sizes the content amounts in their associated kernel buffers, if possible.-S This option specifies an optional time-out seconds value for kernel functions - <b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2), <b><a href=/man/2/readlink rel=nofollow>readlink</a></b>(2), and <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) - that mightotherwise deadlock. The minimum for t is two; the default, fifteen; when no value is specified, the default is used.See the<b>BLOCKS AND TIMEOUTS</b> section for more information.-T This option controls the reporting of some TCP/TPI information, also reported by <b>netstat</b>(1), following the network addresses. In normal output theinformation appears in parentheses, each item except TCP or TPI state name identified by a keyword, followed by =, separated from others by a singlespace:<br>   <TCP or TPI state name>    QR=<read queue length>    QS=<send queue length>    SO=<socket options and values>    SS=<socketstates>    TF=<TCP flags and values>    WR=<window read length>    WW=<window write length>Not all values are reported for all UNIX dialects. Items values (when available) are reported after the item name and =.When the field output mode is in effect (See<b>OUTPUT FOR OTHER PROGRAMS</b>.) each item appears as a field with a T leading character.-Twith no following key characters disables TCP/TPI information reporting.-Twith following characters selects the reporting of specific TCP/TPI information:<br>   f    selects reporting of socket options,        states and values, and TCP flags and        values.    q    selects queue lengthreporting.    s    selects connection state reporting.    w    selects window size reporting.Not all selections are enabled for some UNIX dialects. State may be selected for all dialects and is reported by default. The <b>-h</b> or <b>-?</b> helpoutput for the <b>-T</b> option will show what selections may be used with the UNIX dialect.When<b>-T</b> is used to select information - i.e., it is followed by one or more selection characters - the displaying of state is disabled by default, and itmust be explicitly selected again in the characters following <b>-T</b>. (In effect, then, the default is equivalent to <b>-Ts</b>.) For example, if queuelengths and state are desired, use <b>-Tqs</b>.Socket options, socket states, some socket values, TCP flags andone TCP value may be reported (when available in the UNIX dialect) in the form of the names that commonly appear after SO_, so_, SS_, TCP_ and TF_ in thedialects header files - most often &lt;<a href=/include/sys/socket.h rel=nofollow>sys/socket.h</a>&gt;, &lt;<a href=/include/sys/socketvar.h rel=nofollow>sys/socketvar.h</a>&gt; and &lt;netinet/tcp_var.h&gt;. Consult those header files for the meaning ofthe flags, options, states and values.SO= precedes socket options and values; SS=, socket states;and TF=, TCP flags and values.If a flag or option has a value, the value will follow an = andthe name -- e.g., SO=LINGER=5, SO=QLIM=5, TF=MSS=512. The following seven values may be reported:<br>   Name    Reported    Description (Common Symbol)    KEEPALIVE    keep alive time (SO_KEEPALIVE)    LINGER    linger time (SO_LINGER)    MSSmaximum segment size (TCP_MAXSEG)    PQLEN    partial listen queue connections    QLEN        established listen queue connections    QLIM        establishedlisten queue limit    RCVBUF    receive buffer length (SO_RCVBUF)    SNDBUF    send buffer length (SO_SNDBUF)Details on what socket options and values, socket states, and TCP flags and values may be displayed for particular UNIX dialects may be found in the answerto the Why doesnt lsof report socket options, socket states, and TCP flags and values for my dialect? and Why doesnt lsof report the partial listenqueue connection count for my dialect? questions in the lsof FAQ (The <b>FAQ</b> section gives its location.)-tThis option specifies that lsof should produce terse output with process identifiers only and no header - e.g., so that the output may be piped to<b><a href=/man/1/kill>kill</a></b>(1). This option selects the <b>-w</b> option.-u This option selects the listing of files for the user whose login names or user ID numbers are in the comma-separated set s - e.g., abe, or548,root. (There should be no spaces in the set.)Multiple login names or user ID numbers are joined in a single ORed setbefore participating in AND option selection.If a login name or user ID is preceded by a ^, it becomes a negation i.e., files of processes owned by the login name or user ID will never be listed. A negated login name or user ID selection is neither ANDed nor ORed withother selections; it is applied before all other selections and absolutely excludes the listing of the files of the process. For example, to direct lsofto exclude the listing of files belonging to root processes, specify -u^root or -u^0.-UThis option selects the listing of UNIX domain socket files.-vThis option selects the listing of lsof version information, including: revision number; when the lsof binary was constructed; whoconstructed the binary and where; the name of the compiler used to construct the lsof binary; the version number of the compiler when readily available;the compiler and loader flags used to construct the lsof binary; and system information, typically the output of unames <b>-a</b> option.-VThis option directs lsof to indicate the items it was asked to list and failed to find - command names, file names, Internet addresses or files,login names, NFS files, PIDs, PGIDs, and UIDs.When other options are ANDed to search options, or compile-timeoptions restrict the listing of some files, lsof may not report that it failed to find a search item when an ANDed option or compile-time optionprevents the listing of the open file containing the located search item.For example, lsof -V -iTCP@foobar -a -d 999 may not report afailure to locate open files at TCP@foobar and may not list any, if none have a file descriptor number of 999. A similar situation arises whenHASSECURITY and HASNOSOCKSECURITY are defined at compile time and they prevent the listing of open files.+|-wEnables (<b>+</b>) or disables (<b>-</b>) the suppression of warning messages.Thelsof builder may choose to have warning messages disabled or enabled by default. The default warning message state is indicated in the output of the<b>-h</b> or <b>-?</b> option. Disabling warning messages when they are already disabled or enabling them when already enabled is acceptable.The<b>-t</b> option selects the <b>-w</b> option.-x  [fl]This option may accompany the <b>+d</b> and <b>+D</b> options to direct their processing to cross over symbolic links and|or file system mount pointsencountered when scanning the directory (<b>+d</b>) or directory tree (<b>+D</b>).If<b>-x</b> is specified by itself without a following parameter, cross-over processing of both symbolic links and file system mount points is enabled. Notethat when <b>-x</b> is specified without a parameter, the next argument must begin with - or +.The optional f parameter enables file system mount point cross-overprocessing; l, symbolic link cross-over processing.The<b>-x</b> option may not be supplied without also supplying a <b>+d</b> or <b>+D</b> option.-XThis is a dialect-specific option.    AIX:<br>This IBM AIX RISC/System 6000 option requests the reporting of executed text file and shared library references.WARNING:because this option uses the kernel readx() function, its use on a busy AIX system might cause an application process to hang so completely that it canneither be killed nor stopped. I have never seen this happen or had a report of its happening, but I think there is a remote possibility it could happen.By default use of readx() is disabled.On AIX 5L and above lsof may need setuid-root permission to perform the actions this option requests.Thelsof builder may specify that the <b>-X</b> option be restricted to processes whose real UID is root. If that has been done, the <b>-X</b> optionwill not appear in the <b>-h</b> or <b>-?</b> help output unless the real UID of the lsof process is root. The default lsof distribution allowsany UID to specify <b>-X,</b> so by default it will appear in the help output.When AIX readx() useis disabled, lsof may not be able to report information for all text and loader file references, but it may also avoid exacerbating an AIX kerneldirectory search kernel error, known as the Stale Segment ID bug.The readx() function, used bylsof or any other program to access some sections of kernel virtual memory, can trigger the Stale Segment ID bug. It can cause the kernelsdir_search() function to believe erroneously that part of an in-memory copy of a file system directory has been zeroed. Another application process, distinctfrom lsof, asking the kernel to search the directory - e.g., by using <b><a href=/man/2/open>open</a></b>(2) - can cause dir_search() to loop forever, thus hanging theapplication process.Consult thelsof FAQ (The <b>FAQ</b> section gives its location.) and the 00README file of the lsof distribution for a more complete descriptionof the Stale Segment ID bug, its APAR, and methods for defining readx() use when compiling lsof.    Linux:<br>This Linux option requests that lsof skip the reporting of information on all open TCP, UDP and UDPLITE IPv4 and IPv6 files.This Linux option is most useful when the system has an extremelylarge number of open TCP, UDP and UDPLITE files, the processing of whose information in the /proc/net/tcp* and /proc/net/udp* files wouldtake lsof a long time, and whose reporting is not of interest.Use this option with care and only when you are sure that theinformation you want lsof to display isnt associated with open TCP, UDP or UDPLITE socket files.    Solaris 10 and above:<br>This Solaris 10 and above option requests the reporting of cached paths for files that have been deleted - i.e., removed with <b><a href=/man/1/rm>rm</a></b>(1) or <b><a href=/man/2/unlink>unlink</a></b>(2).The cached path is followed by the string  (deleted) to indicatethat the path by which the file was opened has been deleted.Because intervening changes made to the path - i.e., renames with<b><a href=/man/1/mv>mv</a></b>(1) or <b><a href=/man/2/rename>rename</a></b>(2) - are not recorded in the cached path, what lsof reports is only the path by which the file was opened, not itspossibly different final path.-z specifies how Solaris 10 and higher zone information is to be handled.Without a following argument - e.g., NOz - the option specifies that zone names are to be listed in the ZONE output column.The<b>-z</b> option may be followed by a zone name, <b>z</b>. That causes lsof to list only open files for processes in that zone. Multiple <b>-z</b>z option and argument pairs may be specified to form a list of named zones. Any open file of any process in any of the zones will be listed, subject toother conditions specified by other options and arguments.-Z[Z]specifies how SELinux security contexts are to be handled. This option and Z field output character support are inhibited when SELinux is disabled in therunning Linux kernel. See <b>OUTPUT FOR OTHER PROGRAMS</b> for more information on the Z field output character.Without a following argument - e.g., NOZ - the option specifies that security contexts are to be listed in the SECURITY-CONTEXT output column.The<b>-Z</b> option may be followed by a wildcard security context name, <b>Z</b>. That causes lsof to list only open files for processes in thatsecurity context. Multiple <b>-Z</b> Z option and argument pairs may be specified to form a list of security contexts. Any open file of any process inany of the security contexts will be listed, subject to other conditions specified by other options and arguments. Note that Z can be A:B:C or *:B:C orA:B:* or *:*:C to match against the A:B:C context.The double minus sign option is a marker that signals the end of the keyed options. It may be used, for example, when the first file name begins with aminus sign. It may also be used when the absence of a value for the last keyed option must be signified by the presence of a minus sign in the following optionand before the start of the file names.namesThese are path names of specific files to list. Symbolic links are resolved before use. The first name may be separated from the preceding options with the-- option.If aname is the mounted-on directory of a file system or the device of the file system, lsof will list all the files open on the file system. Tobe considered a file system, the name must match a mounted-on directory name in <b><a href=mount rel=nofollow>mount</a></b>(8) output, or match the name of a block device associatedwith a mounted-on directory name. The <b>+|-f</b> option may be used to force lsof to consider a name a file system identifier (<b>+f</b>) or asimple file (<b>-f</b>).Ifname is a path to a directory that is not the mounted-on directory name of a file system, it is treated just as a regular file is treated - i.e.,its listing is restricted to processes that have it open as a file or as a process-specific directory, such as the root or current working directory. Torequest that lsof look for open files inside a directory name, use the <b>+d</b> s and <b>+D</b> D options.If aname is the base name of a family of multiplexed files - e. g, AIXs /dev/pt[cs] - lsof will list all the associated multiplexed fileson the device that are open - e.g., /dev/pt[cs]/1, /dev/pt[cs]/2, etc.If aname is a UNIX domain socket name, lsof will usually search for it by the characters of the name alone - exactly as it is specified and isrecorded in the kernel socket structure. (See the next paragraph for an exception to that rule for Linux.) Specifying a relative path - e.g., ./file in place of the files absolute path - e.g., /tmp/file - wont work because lsof must match the characters you specify with what it finds in thekernel UNIX domain socket structures.If aname is a Linux UNIX domain socket name, in one case lsof is able to search for it by its device and inode number, allowing name to bea relative path. The case requires that the absolute path -- i.e., one beginning with a slash (/) be used by the process that created the socket, and hencebe stored in the /proc/net/unix file; and it requires that lsof be able to obtain the device and node numbers of both the absolute path in/proc/net/unix and name via successful <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) system calls. When those conditions are met, lsof will be able to search for theUNIX domain socket when some path to it is is specified in name. Thus, for example, if the path is /dev/log, and an lsof search isinitiated when the working directory is /dev, then name could be ./log.If aname is none of the above, lsof will list any open files whose device and inode match that of the specified path name.If you have also specified the<b>-b</b> option, the only names you may safely specify are file systems for which your mount table supplies alternate device numbers. See the<b>AVOIDING KERNEL BLOCKS</b> and <b>ALTERNATE DEVICE NUMBERS</b> sections for more information.Multiple file names are joined in a single ORed set beforeparticipating in AND option selection."},{"id": 18626,"commandid" : 2462,"title": "Afs","page": "<br><br>Lsof may have trouble identifying all aspects of AFS files in supported dialects when AFS kernel support is implemented via dynamic modules whoseaddresses do not appear in the kernels variable name list. In that case, lsof may have to guess at the identity of AFS files, and might not be able toobtain volume information from the kernel that is needed for calculating AFS volume node numbers. When lsof cant compute volume node numbers, itreports blank in the NODE column.<br><br>The <b>-A</b> A option is available in some dialect implementations of lsof for specifying the name list file where dynamic module kerneladdresses may be found. When this option is available, it will be listed in the lsof help output, presented in response to the <b>-h</b> or <b>-?</b><br><br>See the lsof FAQ (The <b>FAQ</b> section gives its location.) for more information about dynamic modules, their symbols, and how they affectlsof options.<br><br>Because AFS path lookups dont seem to participate in the kernels name cache operations, lsof cant identify path name components for AFS files."},{"id": 18627,"commandid" : 2462,"title": "Security","page": "-k and -m options name alternate kernel name list or memory files.<br><br>Restricting the listing of all open files is controlled by the compile-time HASSECURITY and HASNOSOCKSECURITY options. When HASSECURITY is defined,lsof will allow only the root user to list all open files. The non-root user may list only open files of processes with the same user IDentificationnumber as the real user ID number of the lsof process (the one that its user logged on with).<br><br>However, if HASSECURITY and HASNOSOCKSECURITY are both defined, anyone may list open socket files, provided they are selected with the <b>-i</b> option.<br><br>When HASSECURITY is not defined, anyone may list all open files.<br><br>Help output, presented in response to the <b>-h</b> or <b>-?</b> option, gives the status of the HASSECURITY and HASNOSOCKSECURITY definitions.<br><br>See the <b>Security</b> section of the 00README file of the lsof distribution for information on building lsof with the HASSECURITY andHASNOSOCKSECURITY options enabled.<br><br>Creation and use of a user-readable and user-writable device cache file is controlled by the compile-time HASDCACHE option. See the <b>DEVICE CACHE FILE</b>section and the sections that follow it for details on how its path is formed. For security considerations it is important to note that in the defaultlsof distribution, if the real user ID under which lsof is executed is root, the device cache file will be written in roots home directory e.g., / or /root. When HASDCACHE is not defined, lsof does not write or attempt to read a device cache file.<br><br>When HASDCACHE is defined, the lsof help output, presented in response to the <b>-h</b>, <b>-D?</b>, or <b>-?</b> options, will provide device cachefile handling information. When HASDCACHE is not defined, the <b>-h</b> or <b>-?</b> output will have no <b>-D</b> option description.<br><br>Before you decide to disable the device cache file feature - enabling it improves the performance of lsof by reducing the startup overhead ofexamining all the nodes in /dev (or /devices) - read the discussion of it in the 00DCACHE file of the lsof distribution and thelsof FAQ (The <b>FAQ</b> section gives its location.)<br><br>WHEN IN DOUBT, YOU CAN TEMPORARILY DISABLE THE USE OF THE DEVICE CACHE FILE WITH THE <b>-Di</b> OPTION.<br><br>When lsof user declares alternate kernel name list or memory files with the <b>-k</b> and <b>-m</b> options, lsof checks the users authorityto read them with <b><a href=/man/2/access>access</a></b>(2). This is intended to prevent whatever special power lsofs modes might confer on it from letting it read files notnormally accessible via the authority of the real user ID."},{"id": 18628,"commandid" : 2462,"title": "Output","page": "This section describes the information OUTPUT FOROTHER PROGRAMS section for additional information on output that can be processed by another program.<br><br>Lsof only outputs printable (declared so by <b><a href=/man/3/isprint>isprint</a></b>(3)) 8 bit characters. Non-printable characters are printed in one of three forms: the C[bfrnt] form; the control character ^ form (e.g., ^@); or hexadecimal leading x form (e.g., xab). Space is non-printable in the COMMANDcolumn (x20) and printable elsewhere.<br><br>For some dialects - if HASSETLOCALE is defined in the dialects machine.h header file - lsof will print the extended 8 bit characters of a languagelocale. The lsof process must be supplied a language locale environment variable (e.g., LANG) whose value represents a known language locale in whichthe extended characters are considered printable by <b><a href=/man/3/isprint rel=nofollow>isprint</a></b>(3). Otherwise lsof considers the extended characters non-printable and prints themaccording to its rules for non-printable characters, stated above. Consult your dialects <b><a href=/man/3/setlocale>setlocale</a></b>(3) man page for the names of other environmentvariables that may be used in place of LANG - e.g., LC_ALL, LC_CTYPE, etc.<br><br>Lsofs language locale support for a dialect also covers wide characters - e.g., UTF-8 - when HASSETLOCALE and HASWIDECHAR are defined in thedialects machine.h header file, and when a suitable language locale has been defined in the appropriate environment variable for the lsof process. Widecharacters are printable under those conditions if <b><a href=/man/3/iswprint>iswprint</a></b>(3) reports them to be. If HASSETLOCALE, HASWIDECHAR and a suitable language locale arentdefined, or if <b><a href=/man/3/iswprint rel=nofollow>iswprint</a></b>(3) reports wide characters that arent printable, lsof considers the wide characters non-printable and prints each oftheir 8 bits according to its rules for non-printable characters, stated above.<br><br>Consult the answers to the Language locale support questions in the lsof FAQ (The <b>FAQ</b> section gives its location.) for more information.<br><br>Lsof dynamically sizes the output columns each time it runs, guaranteeing that each column is a minimum size. It also guarantees that each column isseparated from its predecessor by at least one space.contains the first nine characters of the name of the UNIX command associated with the process. If a non-zero w value is specified to the<b>+c</b>w option, the column contains the first w characters of the name of the UNIX command associated with the process up to the limit ofcharacters supplied to lsof by the UNIX dialect. (See the description of the <b>+c</b> w command or the lsof FAQ for more information. The<b>FAQ</b> section gives its location.)Ifw is less than the length of the column title, COMMAND, it will be raised to that length.If a zerow value is specified to the <b>+c</b> w option, the column contains all the characters of the name of the UNIX command associated with theprocess.All command name characters maintained by the kernel in its structuresare displayed in field output when the command name descriptor (c) is specified. See the <b>OUTPUT FOR OTHER COMMANDS</b> section for information onselecting field output and the associated command name descriptor.PIDis the Process IDentification number of the process.ZONEis the Solaris 10 and higher zone name. This column must be selected with the <b>-z</b> option.SECURITY-CONTEXTis the SELinux security context. This column must be selected with the <b>-Z</b> option. Note that the <b>-Z</b> option is inhibited when SELinux isdisabled in the running Linux kernel.PPIDis the Parent Process IDentification number of the process. It is only displayed when the <b>-R</b> option has been specified.PGIDis the process group IDentification number associated with the process. It is only displayed when the <b>-g</b> option has been specified.USERis the user ID number or login name of the user to whom the process belongs, usually the same as reported by <b><a href=/man/1/ps>ps</a></b>(1). However, on Linux USER is theuser ID number or login that owns the directory in /proc where lsof finds information about the process. Usually that is the same value reported by<b><a href=/man/1/ps rel=nofollow>ps</a></b>(1), but may differ when the process has changed its effective user ID. (See the <b>-l</b> option description for information on when a user ID numberor login name is displayed.)FDis the File Descriptor number of the file or:<br>   cwd    current working directory;    Lnn    library references (AIX);    err    FD information error (see NAME column);jld    jail directory (FreeBSD);    ltx    shared library text (code and data);    Mxx    hex memory-mapped type number xx.    m86DOS Merge mapped file;    mem    memory-mapped file;    mmap    memory-mapped device;    pd    parent directory;    rtd    rootdirectory;    tr    kernel trace file (OpenBSD);    txt    program text (code and data);    v86    VP/ix mapped file;FD is followed by one of these characters, describing the mode under which the file is open:<br>   r for read access;<br><b>w</b> for write access;<p><b>u</b> for read and write access;</p><p>space if mode unknown and no lock</p><p>character follows;</p><p>- if mode unknown and lock</p><p>character follows.<br></p>The mode character is followed by one of these lock characters, describingthe type of lock applied to the file:<br>   N for a Solaris NFS lock of unknown type;<br><b>r</b> for read lock on part of the file;<p><b>R</b> for a read lock on the entire file;</p><p><b>w</b> for a write lock on part of the file;</p><p><b>W</b> for a write lock on the entire file;</p><p><b>u</b> for a read and write lock of any length;</p><p><b>U</b> for a lock of unknown type;</p><p><b>x</b> for an SCO OpenServer Xenix lock on part<br>of the file;</p><p><b>X</b> for an SCO OpenServer Xenix lock on the<br>entire file;</p><p>space if there is no lock.<br></p>See the<b>LOCKS</b> section for more information on the lock information character.The FD column contents constitutes a single field for parsing inpost-processing scripts.TYPEis the type of the node associated with the file - e.g., GDIR, GREG, VDIR, VREG, etc.or IPv4 for an IPv4 socket;IPv4, mapped in an IPv6 address;or ax25 for a Linux AX.25 socket;the directory path appears in the NAME column, followed by an error message;or PAS for a/proc/as file;or PAXV for a/proc/auxv file;or PCRE for a/proc/cred file;or PCTL for a/proc control file;or PCUR for the current/proc process;or PCWD for a/proc current working directory;or PDIR for a/proc directory;or PETY for a/proc executable type (etype);or PFD for a/proc file descriptor;or PFDR for a/proc file descriptor directory;or PFIL for an executable/proc file;or PFPR for a/proc FP register set;or PGD for a/proc/pagedata file;or PGID for a/proc group notifier file;or PIPE for pipes;/proc/lwpctl file;or PLDR for a/proc/lpw directory;or PLDT for a/proc/ldt file;or PLPI for a/proc/lpsinfo file;or PLST for a/proc/lstatus file;or PLU for a/proc/lusage file;or PLWG for a/proc/gwindows file;or PLWI for a/proc/lwpsinfo file;or PLWS for a/proc/lwpstatus file;or PLWU for a/proc/lwpusage file;or PLWX for a/proc/xregs fileor PMAP for a/proc map file (map);or PMEM for a/proc memory image file;or PNTF for a/proc process notifier file;or POBJ for a/proc/object file;or PODR for a/proc/object directory;or POLP for an old format/proc light weight process file;or POPF for an old format/proc PID file;or POPG for an old format/proc page data file;or PORT for a SYSV named pipe;/proc register file;or PRMP for a/proc/rmap file;or PRTD for a/proc root directory;or PSGA for a/proc/sigact file;or PSIN for a/proc/psinfo file;or PSTA for a/proc status file;or PSXSEM for a POSIX semaphore file;/proc/usage file;or PW for a/proc/watch file;or PXMP for a/proc/xmap file;or REG for a regular file;contains the kernel file structure address when <b>f</b> has been specified to <b>+f</b>;FCTcontains the file reference count from the kernel file structure when <b>c</b> has been specified to <b>+f</b>;FILE-FLAGwhen <b>g</b> or <b>G</b> has been specified to <b>+f</b>, this field contains the contents of the f_flag[s] member of the kernel file structure and thekernels per-process open file flags (if available); G causes them to be displayed in hexadecimal; g, as short-hand names; two lists may be displayed withentries separated by commas, the lists separated by a semicolon (;); the first list may contain short-hand names for f_flag[s] values from the followingtable:<br>   AIO        asynchronous I/O (e.g., FAIO)    AP        append    ASYN        asynchronous I/O (e.g., FASYNC)    BAS        block, test, and set in useBKIU        block if in use    BL        use block offsets    BSK        block seek    CA        copy avoid    CIO        concurrent I/O    CLON        cloneCLRD        CL read    CR        create    DF        defer    DFI        defer IND    DFLU        data flush    DIR        direct    DLY        delay    DOCLdo clone    DSYN        data-only integrity    DTY        must be a directory    EVO        event only    EX        open for exec    EXCLexclusive open    FSYN        synchronous writes    GCDF        defer during unp_gc() (AIX)    GCMK        mark during unp_gc() (AIX)    GTTY        accessedvia /dev/tty    HUP        HUP in progress    KERN        kernel    KIOC        kernel-issued ioctl    LCK        has lock    LG        large file    MBLKstream message block    MK        mark    MNT        mount    MSYN        multiplex synchronization    NATM        dont update atime    NBnon-blocking I/O    NBDR        no BDRM check    NBIO        SYSV non-blocking I/O    NBF        n-buffering in effect    NC        no cache    ND        nodelay    NDSY        no data synchronization    NET        network    NFLK        dont follow links    NMFS        NM file system    NOTO        disablebackground stop    NSH        no share    NTTY        no controlling TTY    OLRM        OLR mirror    PAIO        POSIX asynchronous I/O    PP        POSIXpipe    R        read    RC        file and record locking cache    REV        revoked    RSH        shared read    RSYN        read synchronization    RWread and write access    SL        shared lock    SNAP        cooked snapshot    SOCK        socket    SQSH        Sequent shared set on open    SQSVSequent SVM set on open    SQR        Sequent set repair on open    SQS1        Sequent full shared open    SQS2        Sequent partial shared open    STPIstop I/O    SWR        synchronous read    SYN        file integrity while writing    TCPM        avoid TCP collision    TR        truncate    Wwrite    WKUP        parallel I/O synchronization    WTG        parallel I/O synchronization    VH        vhangup pending    VTXT        virtual text    XLexclusive lockthis list of names was derived from F* #defines in dialect header files &lt;<a href=/include/fcntl.h rel=nofollow>fcntl.h</a>&gt;, &lt;linux&lt;/fs.h&gt;, &lt;sys/fcntl.c&gt;,&lt;sys/fcntlcom.h&gt;, and &lt;<a href=/include/sys/file.h rel=nofollow>sys/file.h</a>&gt;; see the lsof.h header file for a list showing the correspondence between the above short-hand names and theheader file definitions;the second list (after the semicolon) may contain short-hand namesfor kernel per-process open file flags from this table:<br>   ALLC        allocated    BR        the file has been read    BHUP        activity stopped by SIGHUP    BW        the file has been written    CLSGclosing    CX        close-on-exec (see fcntl(F_SETFD))    LCK        lock was applied    MP        memory-mapped    OPIP        open pending - in progressRSVW        reserved wait    SHMT        UF_FSHMAT set (AIX)    USE        in use (multi-threaded)NODE-ID(or INODE-ADDR for some dialects) contains a unique identifier for the file node (usually the kernel vnode or inode address, but also occasionally aconcatenation of device and node number) when <b>n</b> has been specified to <b>+f</b>;DEVICEcontains the device numbers, separated by commas, for a character special, block special, regular, directory or NFS file;or memory for a memory file system node under Tru64 UNIX;stream;or a kernel reference address that identifies the file(The kernel reference address may be used for FIFOs, for example.);orthe base address or device name of a Linux AX.25 socket device.Usually only the lower thirty two bits of Tru64 UNIX kernel addressesare displayed.SIZE, SIZE/OFF, or OFFSETis the size of the file or the file offset in bytes. A value is displayed in this column only if it is available. Lsof displays whatever value size or offset - is appropriate for the type of the file and the version of lsof.On some UNIX dialectslsof cant obtain accurate or consistent file offset information from its kernel data sources, sometimes just for particular kinds of files (e.g.,socket files.) In other cases, files dont have true sizes - e.g., sockets, FIFOs, pipes - so lsof displays for their sizes the content amounts it findsin their kernel buffer descriptors (e.g., socket buffer size counts or TCP/IP window sizes.) Consult the lsof FAQ (The <b>FAQ</b> section gives itslocation.) for more information.The file size is displayed in decimal;the offset is normally displayed in decimal with a leading 0t if it contains 8 digits or less; in hexadecimal with a leading 0x if it is longerthan 8 digits. (Consult the <b>-o</b> o option description for information on when 8 might default to some other value.)Thus the leading 0t and 0x identify an offset when the columnmay contain both a size and an offset (i.e., its title is SIZE/OFF).If the<b>-o</b> option is specified, lsof always displays the file offset (or nothing if no offset is available) and labels the column OFFSET. The offsetalways begins with 0t or 0x as described above.Thelsof user can control the switch from 0t to 0x with the <b>-o</b> o option. Consult its description for more information.If the<b>-s</b> option is specified, lsof always displays the file size (or nothing if no size is available) and labels the column SIZE. The <b>-o</b> and<b>-s</b> options are mutually exclusive; they cant both be specified.For files that dont have a fixed size - e.g., dont resideon a disk device - lsof will display appropriate information about the current size or position of the file if it is available in the kernelstructures that define the file.NLINKcontains the file link count when <b>+L</b> has been specified;NODEis the node number of a local file;or the inode number of an NFS file in the server host;is the name of the mount point and file system on which the file resides;or the name of a file specified in thenames option (after any symbolic links have been resolved);or the name of a character special or block special device;the local host name or IP number is followed by a colon (:), the port, -&gt;, and the two-part remote address; IP addresses may be reported asnumbers or names, depending on the <b>+|-M</b>, <b>-n</b>, and <b>-P</b> options; colon-separated IPv6 numbers are enclosed in square brackets; IPv4 INADDR_ANYand IPv6 IN6_IS_ADDR_UNSPECIFIED addresses, and zero port numbers are represented by an asterisk (*); a UDP destination address may be followed by the amountof time elapsed since the last packet was sent to the destination; TCP, UDP and UDPLITE remote addresses may be followed by TCP/TPI information in parentheses- state (e.g., (ESTABLISHED), (Unbound)), queue sizes, and window sizes (not all dialects) - in a fashion similar to what <b>netstat</b>(1) reports;see the <b>-T</b> option description or the description of the TCP/TPI field in <b>OUTPUT FOR OTHER PROGRAMS</b> for more information on state, queue size, andwindow size;or the address or name of a UNIX domain socket, possibly includinga stream clone device name, a file system objects path name, local and foreign kernel addresses, socket pair information, and a bound vnode address;or the local and remote mount point names of an NFS file;or a list of stream module names, separated by -&gt;;or STR: followed by the SCO OpenServer stream device and modulenames, separated by -&gt;;or system directory name,  -- , and as many components of the pathname as lsof can find in the kernels name cache for selected dialects (See the <b>KERNEL NAME CACHE</b> section for more information.);or PIPE->, followed by a Solaris kernel pipe destination address;device name, for a Solaris common vnode;or the address family, followed by a slash (/), followed by fourteencomma-separated bytes of a non-Internet raw socket address;or the HP-UX x.25 local address, followed by the virtual connectionnumber (if any), followed by the remote address (if any);or (dead) for disassociated Tru64 UNIX files - typically terminal filesthat have been flagged with the TIOCNOTTY ioctl and closed by daemons;or rd=<offset> and wr=<offset> for the values of theread and write offsets of a FIFO;or clone /dev/event device, where n is the minor device number of the file;or (socketpair: n) for a Solaris 2.6, 8, 9 or 10UNIX domain socket, created by the <b>socketpair</b>(3N) network function;or no PCB for socket files that do not have a protocol blockassociated with them, optionally followed by , CANTSENDMORE if sending on the socket has been disabled, or , CANTRCVMORE if receiving on the sockethas been disabled (e.g., by the <b><a href=/man/2/shutdown>shutdown</a></b>(2) function);or the local and remote addresses of a Linux IPX socket filein the form &lt;net&gt;:[&lt;node&gt;:]&lt;port&gt;, followed in parentheses by the transmit and receive queue sizes, and the connection state;or dgram or stream for the type UnixWare 7.1.1 and above in-kernelUNIX domain sockets, followed by a colon (:) and the local path name when available, followed by -&gt; and the remote path name or kernel socketaddress in hexadecimal when available.<br><br>For dialects that support a namefs file system, allowing one file to be attached to another with <b>fattach</b>(3C), lsof will add(FA:&lt;address1&gt;&lt;direction&gt;&lt;address2&gt;) to the NAME column. &lt;address1&gt; and &lt;address2&gt; are hexadecimal vnode addresses.&lt;direction&gt; will be &lt;- if &lt;address2&gt; has been fattached to this vnode whose address is &lt;address1&gt;; and -&gt; if &lt;address1&gt;,the vnode address of this vnode, has been fattached to &lt;address2&gt;. &lt;address1&gt; may be omitted if it already appears in the DEVICE column.<br><br>Lsof may add two parenthetical notes to the NAME column for open Solaris 10 files: (?) if lsof considers the path name of questionable accuracy;and (deleted) if the <b>-X</b> option has been specified and lsof detects the open files path name has been deleted. Consult the lsof FAQ(The <b>FAQ</b> section gives its location.) for more information on these NAME column additions."},{"id": 18629,"commandid" : 2462,"title": "Locks","page": "<br><br>Moreover, when a process holds several byte level locks on a file, lsof only reports the status of the first lock it encounters. If it is a bytelevel lock, then the lock character will be reported in lower case - i.e., r, w, or x - rather than the upper case equivalent reported for a full filelock.<br><br>Generally lsof can only report on locks held by local processes on local files. When a local process sets a lock on a remotely mounted (e.g., NFS)file, the remote server host usually records the lock state. One exception is Solaris - at some patch levels of 2.3, and in all versions above 2.4, the Solariskernel records information on remote locks in local structures.<br><br>Lsof has trouble reporting locks for some UNIX dialects. Consult the <b>BUGS</b> section of this manual page or the lsof FAQ (The <b>FAQ</b>section gives its location.) for more information."},{"id": 18630,"commandid" : 2462,"title": "Output for Other Programs","page": "When the -F option is specified, <br><br>Each unit of information is output in a field that is identified with a leading character and terminated by a NL (012) (or a NUL (000) if the 0 (zero) fieldidentifier character is specified.) The data of the field follows immediately after the field identification character and extends to the field terminator.<br><br>It is possible to think of field output as process and file sets. A process set begins with a field whose identifier is p (for process IDentifier (PID)).It extends to the beginning of the next PID field or the beginning of the first file set of the process, whichever comes first. Included in the process set arefields that identify the command, the process group IDentification (PGID) number, and the user ID (UID) number or login name.<br><br>A file set begins with a field whose identifier is f (for file descriptor). It is followed by lines that describe the files access mode, lock state,type, device, size, offset, inode, protocol, name and stream module names. It extends to the beginning of the next file or process set, whichever comes first.<br><br>When the NUL (000) field terminator has been selected with the 0 (zero) field identifier character, lsof ends each process and file set with a NL(012) character.<br><br>Lsof always produces one field, the PID (p) field. All other fields may be declared optionally in the field identifier character list that followsthe <b>-F</b> option. When a field selection character identifies an item lsof does not normally list - e.g., PPID, selected with <b>-R</b> specification of the field character - e.g., <b>-FR</b> - also selects the listing of the item.<br><br>It is entirely possible to select a set of fields that cannot easily be parsed - e.g., if the field descriptor field is not selected, it may be difficult toidentify file sets. To help you avoid this difficulty, lsof supports the <b>-F</b> option; it selects the output of all fields with NL terminators (the<b>-F0</b> option pair selects the output of all fields with NUL terminators). For compatibility reasons neither <b>-F</b> nor <b>-F0</b> select the raw devicefield.<br><br>These are the fields that lsof will produce. The single character listed first is the field identifier.   -F? option pair. (Escape the ? character as yourshell requires.) Additional information on field content can be found in the OUTPUT section.<br><br>As an example, <b>-F pcfn</b> will select the process ID (p), command name (c), file descriptor (f) and file name (n) fields with an NL fieldterminator character; <b>-F pcfn0</b> selects the same output with a NUL (000) field terminator character.<br><br>Lsof doesnt produce all fields for every process or file set, only those that are available. Some fields are mutually exclusive: file devicecharacters and file major/minor device numbers; file inode number and protocol name; file name and stream identification; file size and offset. One or theother member of these mutually exclusive sets will appear in field output, but not both.<br><br>Normally lsof ends each field with a NL (012) character. The 0 (zero) field identifier character may be specified to change the field terminatorcharacter to a NUL (000). A NUL terminator may be easier to process with xargs (1), for example, or with programs whose quoting mechanisms may noteasily cope with the range of characters in the field output. When the NUL field terminator is in use, lsof ends each process and file set with a NL(012).<br><br>Three aids to producing programs that can process lsof field output are included in the lsof distribution. The first is a C header file,lsof_fields.h, that contains symbols for the field identification characters, indexes for storing them in a table, and explanation strings that may becompiled into programs. Lsof uses this header file.<br><br>The second aid is a set of sample scripts that process field output, written in awk, Perl 4, and Perl 5. Theyre located in thescripts subdirectory of the lsof distribution.<br><br>The third aid is the C library used for the lsof test suite. The test suite is written in C and uses field output to validate the correct operationof lsof. The library can be found in the tests/LTlib.c file of the lsof distribution. The library uses the first aid, thelsof_fields.h header file."},{"id": 18631,"commandid" : 2462,"title": "Blocks and Timeouts","page": "<a href=/man/2/lstat rel=nofollow>lstat</a>(2)<a href=/man/2/readlink rel=nofollow>readlink</a>(2)<a href=/man/2/stat rel=nofollow>stat</a>(2)<br><br>Lsof attempts to break these blocks with timers and child processes, but the techniques are not wholly reliable. When lsof does manage tobreak a block, it will report the break with an error message. The messages may be suppressed with the <b>-t</b> and <b>-w</b> options.<br><br>The default timeout value may be displayed with the <b>-h</b> or <b>-?</b> option, and it may be changed with the <b>-S</b> [t] option. The minimumfor t is two seconds, but you should avoid small values, since slow system responsiveness can cause short timeouts to expire unexpectedly and perhapsstop lsof before it can produce any output.<br><br>When lsof has to break a block during its access of mounted file system information, it normally continues, although with less information availableto display about open files.<br><br>Lsof can also be directed to avoid the protection of timers and child processes when using the kernel functions that might block by specifying the<b>-O</b> option. While this will allow lsof to start up with less overhead, it exposes lsof completely to the kernel situations that might blockit. Use this option cautiously."},{"id": 18632,"commandid" : 2462,"title": "Avoiding Kernel Blocks","page": "<br><br>You can use the <b>-b</b> option to tell lsof to avoid using kernel functions that would block. Some cautions apply.<br><br>First, using this option usually requires that your system supply alternate device numbers in place of the device numbers that lsof would normallyobtain with the <b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2) and <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) kernel functions. See the <b>ALTERNATE DEVICE NUMBERS</b> section for more information on alternate devicenumbers.<br><br>Second, you cant specify names for lsof to locate unless theyre file system names. This is because lsof needs to know the device andinode numbers of files listed with names in the lsof options, and the <b>-b</b> option prevents lsof from obtaining them. Moreover, sincelsof only has device numbers for the file systems that have alternates, its ability to locate files on file systems depends completely on theavailability and accuracy of the alternates. If no alternates are available, or if theyre incorrect, lsof wont be able to locate files on the namedfile systems.<br><br>Third, if the names of your file system directories that lsof obtains from your systems mount table are symbolic links, lsof wont be able toresolve the links. This is because the <b>-b</b> option causes lsof to avoid the kernel <b><a href=/man/2/readlink rel=nofollow>readlink</a></b>(2) function it uses to resolve symbolic links.<br><br>Finally, using the <b>-b</b> option causes lsof to issue warning messages when it needs to use the kernel functions that the <b>-b</b> option directsit to avoid. You can suppress these messages by specifying the <b>-w</b> option, but if you do, you wont see the alternate device numbers reported in thewarning messages."},{"id": 18633,"commandid" : 2462,"title": "Alternate Device Numbers","page": "<br><br>On some dialects, when lsof has to break a block because it cant get information about a mounted file system via the <b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2) and<b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) kernel functions, or because you specified the <b>-b</b> option, lsof can obtain some of the information it needs - the device number andpossibly the file system type - from the system mount table. When that is possible, lsof will report the device number it obtained. (You can suppressthe report by specifying the <b>-w</b> option.)<br><br>You can assist this process if your mount table is supported with an /etc/mtab or /etc/mnttab file that contains an options field by adding adev=xxxx field for mount points that do not have one in their options strings. Note: you must be able to edit the file - i.e., some mount tables likerecent Solaris /etc/mnttab or Linux /proc/mounts are read-only and cant be modified.<br><br>You may also be able to supply device numbers using the <b>+m</b> and <b>+m</b> m options, provided they are supported by your dialect. Check theoutput of lsofs <b>-h</b> or <b>-?</b> options to see if the <b>+m</b> and <b>+m</b> m options are available.<br><br>The xxxx portion of the field is the hexadecimal value of the file systems device number. (Consult the st_dev field of the output of the<b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2) and <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) functions for the appropriate values for your file systems.) Heres an example from a Sun Solaris 2.6 /etc/mnttab fora file system remotely mounted via NFS:   <a href=/man/2/lstat rel=nofollow>lstat</a>(2)<a href=/man/2/stat rel=nofollow>stat</a>(2)<br><br>Some dialects that do not use an ASCII /etc/mtab or /etc/mnttab file for the mount table may still provide an alternative device number intheir internal mount tables. This includes AIX, Apple Darwin, FreeBSD, NetBSD, OpenBSD, and Tru64 UNIX. Lsof knows how to obtain the alternative devicenumber for these dialects and uses it when its attempt to <b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2) or <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) the file system is blocked.<br><br>If youre not sure your dialect supplies alternate device numbers for file systems from its mount table, use this lsof incantation to see if itreports any alternate device numbers:<br><br>Look for standard error file warning messages that begin assuming dev=xxxx from ...."},{"id": 18634,"commandid" : 2462,"title": "Kernel Name Cache","page": "<br><br>Lsof is able to examine the kernels name cache or use other kernel facilities (e.g., the ADVFS 4.x tag_to_path() function under Tru64 UNIX) on somedialects for most file system types, excluding AFS, and extract recently used path name components from it. (AFS file system path lookups dont use thekernels name cache; some Solaris VxFS file system operations apparently dont use it, either.)<br><br>Lsof reports the complete paths it finds in the NAME column. If lsof cant report all components in a path, it reports in the NAME column thefile system name, followed by a space, two - characters, another space, and the name components it has located, separated by the / character.<br><br>When lsof is run in repeat mode - i.e., with the <b>-r</b> option specified - the extent to which it can report path name components for the samefile may vary from cycle to cycle. Thats because other running processes can cause the kernel to remove entries from its name cache and replace them withothers.<br><br>Lsofs use of the kernel name cache to identify the paths of files can lead it to report incorrect components under some circumstances. This canhappen when the kernel name cache uses device and node number as a key (e.g., SCO OpenServer) and a key on a rapidly changing file system is reused. If theUNIX dialects kernel doesnt purge the name cache entry for a file when it is unlinked, lsof may find a reference to the wrong entry in the cache. Thelsof FAQ (The <b>FAQ</b> section gives its location.) has more information on this situation.<br><br>Lsof can report path name components for these dialects:   FAQ section gives itslocation.)"},{"id": 18635,"commandid" : 2462,"title": "Device Cache File","page": "<br><br>Examining all members of the /dev (or /devices) node tree with <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) functions can be time consuming. Whats more, the informationthat lsof needs - device number, inode number, and path - rarely changes.<br><br>Consequently, lsof normally maintains an ASCII text file of cached /dev (or /devices) information (exception: the /proc-based Linuxlsof where its not needed.) The local system administrator who builds lsof can control the way the device cache file path is formed, selectingfrom these options:   -h, -D? , or -? help options for the current state of device cache support. The help output lists the defaultread-mode device cache file path that is in effect for the current invocation of -D? option output lists the read-only and write devicecache file paths, the names of any applicable environment variables, and the personal device cache path format.<br><br>Lsof can detect that the current device cache file has been accidentally or maliciously modified by integrity checks, including the computation andverification of a sixteen bit Cyclic Redundancy Check (CRC) sum on the files contents. When lsof senses something wrong with the file, it issues awarning and attempts to remove the current cache file and create a new copy, but only to a path that the process can legitimately write.<br><br>The path from which a lsof process may attempt to read a device cache file may not be the same as the path to which it can legitimately write. Thuswhen lsof senses that it needs to update the device cache file, it may choose a different path for writing it from the path from which it read anincorrect or outdated version.<br><br>If available, the <b>-Dr</b> option will inhibit the writing of a new device cache file. (Its always available when specified without a path nameargument.)<br><br>When a new device is added to the system, the device cache file may need to be recreated. Since lsof compares the mtime of the device cache file withthe mtime and ctime of the /dev (or /devices) directory, it usually detects that a new device has been added; in that case lsof issues awarning message and attempts to rebuild the device cache file.<br><br>Whenever lsof writes a device cache file, it sets its ownership to the real UID of the executing process, and its permission modes to 0600, thisrestricting its reading and writing to the files owner."},{"id": 18636,"commandid" : 2462,"title": "Lsof Permissions that Affect Device Cache File Access","page": "<br><br>Two permissions of the lsof executable affect its ability to access device cache files. The permissions are set by the local system administratorwhen lsof is installed.<br><br>The first and rarer permission is setuid-root. It comes into effect when lsof is executed; its effective UID is then root, while its real (i.e., thatof the logged-on user) UID is not. The lsof distribution recommends that versions for these dialects run setuid-root.   <br><br>An lsof process that has setgid permission usually surrenders the permission after it has accessed the kernel memory devices. When it does that,lsof can allow more liberal device cache path formations. The lsof distribution recommends that versions for these dialects run setgid and beallowed to surrender setgid permission.   -X option is used.)<br><br>Lsof for these dialects does not support a device cache, so the permissions given to the executable dont apply to the device cache file.   "},{"id": 18637,"commandid" : 2462,"title": "Device Cache File Path from the -d Option","page": "<br><br>The <b>-D</b> option provides limited means for specifying the device cache file path. Its <b>?</b> function will report the read-only and write devicecache file paths that lsof will use.<br><br>When the <b>-D b</b>, <b>r</b>, and <b>u</b> functions are available, you can use them to request that the cache file be built in a specific location(<b>b</b>[path]); read but not rebuilt (<b>r</b>[path]); or read and rebuilt (<b>u</b>[path]). The <b>b</b>, <b>r</b>, and <b>u</b>functions are restricted under some conditions. They are restricted when the lsof process is setuid-root. The path specified with the <b>r</b> functionis always read-only, even when it is available.<br><br>The <b>b</b>, <b>r</b>, and <b>u</b> functions are also restricted when the lsof process runs setgid and lsof doesnt surrender the setgidpermission. (See the <b>LSOF PERMISSIONS THAT AFFECT DEVICE CACHE FILE ACCESS</b> section for a list of implementations that normally dont surrender theirsetgid permission.)<br><br>A further <b>-D</b> function, <b>i</b> (for ignore), is always available.<br><br>When available, the <b>b</b> function tells lsof to read device information from the kernel with the <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) function and build a device cachefile at the indicated path.<br><br>When available, the <b>r</b> function tells lsof to read the device cache file, but not update it. When a path argument accompanies <b>-Dr</b>, itnames the device cache file path. The <b>r</b> function is always available when it is specified without a path name argument. If lsof is not runningsetuid-root and surrenders its setgid permission, a path name argument may accompany the <b>r</b> function.<br><br>When available, the <b>u</b> function tells lsof to attempt to read and use the device cache file. If it cant read the file, or if it finds thecontents of the file incorrect or outdated, it will read information from the kernel, and attempt to write an updated version of the device cache file, butonly to a path it considers legitimate for the lsof process effective and real UIDs."},{"id": 18638,"commandid" : 2462,"title": "Device Cache Path from an Environment Variable","page": "<br><br>Lsofs second choice for the device cache file is the contents of the LSOFDEVCACHE environment variable. It avoids this choice if the lsofprocess is setuid-root, or the real UID of the process is root.<br><br>A further restriction applies to a device cache file path taken from the LSOFDEVCACHE environment variable: lsof will not write a device cache fileto the path if the lsof process doesnt surrender its setgid permission. (See the <b>LSOF PERMISSIONS THAT AFFECT DEVICE CACHE FILE ACCESS</b> sectionfor information on implementations that dont surrender their setgid permission.)<br><br>The local system administrator can disable the use of the LSOFDEVCACHE environment variable or change its name when building lsof. Consult the outputof <b>-D?</b> for the environment variables name."},{"id": 18639,"commandid" : 2462,"title": "System-wide Device Cache Path","page": "<br><br>The local system administrator may choose to have a system-wide device cache file when building lsof. That file will generally be constructed by aspecial system administration procedure when the system is booted or when the contents of /dev or /devices) changes. If defined, it islsofs third device cache file path choice.<br><br>You can tell that a system-wide device cache file is in effect for your local installation by examining the lsof help option output - i.e., theoutput from the <b>-h</b> or <b>-?</b> option.<br><br>Lsof will never write to the system-wide device cache file path by default. It must be explicitly named with a <b>-D</b> function in a root-ownedprocedure. Once the file has been written, the procedure must change its permission modes to 0644 (owner-read and owner-write, group-read, and other-read)."},{"id": 18640,"commandid" : 2462,"title": "Personal Device Cache Path (default)","page": "<br><br>The default device cache file path of the lsof distribution is one recorded in the home directory of the real UID that executes lsof. Added tothe home directory is a second path component of the form .lsof_hostname.<br><br>This is lsofs fourth device cache file path choice, and is usually the default. If a system-wide device cache file path was defined when lsofwas built, this fourth choice will be applied when lsof cant find the system-wide device cache file. This is the <b>only</b> time lsof uses twopaths when reading the device cache file.<br><br>The hostname part of the second component is the base name of the executing host, as returned by <b><a href=/man/2/gethostname rel=nofollow>gethostname</a></b>(2). The base name is defined tobe the characters preceding the first . in the <b><a href=/man/2/gethostname rel=nofollow>gethostname</a></b>(2) output, or all the <b><a href=/man/2/gethostname rel=nofollow>gethostname</a></b>(2) output if it contains no ..<br><br>The device cache file belongs to the user ID and is readable and writable by the user ID alone - i.e., its modes are 0600. Each distinct real user ID on agiven host that executes lsof has a distinct device cache file. The hostname part of the path distinguishes device cache files in an NFS-mountedhome directory into which device cache files are written from several different hosts.<br><br>The personal device cache file path formed by this method represents a device cache file that lsof will attempt to read, and will attempt to writeshould it not exist or should its contents be incorrect or outdated.<br><br>The <b>-Dr</b> option without a path name argument will inhibit the writing of a new device cache file.<br><br>The <b>-D?</b> option will list the format specification for constructing the personal device cache file. The conversions used in the format specificationare described in the 00DCACHE file of the lsof distribution."},{"id": 18641,"commandid" : 2462,"title": "Modified Personal Device Cache Path","page": "<br><br>If this option is defined by the local system administrator when lsof is built, the LSOFPERSDCPATH environment variable contents may be used to add acomponent of the personal device cache file path.<br><br>The LSOFPERSDCPATH variable contents are inserted in the path at the place marked by the local system administrator with the %p conversion in theHASPERSDC format specification of the dialects machine.h header file. (Its placed right after the home directory in the default lsofdistribution.)<br><br>Thus, for example, if LSOFPERSDCPATH contains LSOF, the home directory is /Homes/abe, the host name is lsof.itap.purdue.edu, and the HASPERSDCformat is the default (%h/%p.lsof_%L), the modified personal device cache file path is:   <br><br>Lsof will not write to a modified personal device cache file path if the lsof process doesnt surrender setgid permission. (See the <b>LSOFPERMISSIONS THAT AFFECT DEVICE CACHE FILE ACCESS</b> section for a list of implementations that normally dont surrender their setgid permission.)<br><br>If, for example, you want to create a sub-directory of personal device cache file paths by using the LSOFPERSDCPATH environment variable to name it, andlsof doesnt surrender its setgid permission, you will have to allow lsof to create device cache files at the standard personal path and movethem to your subdirectory with shell commands.<br><br>The local system administrator may: disable this option when lsof is built; change the name of the environment variable from LSOFPERSDCPATH tosomething else; change the HASPERSDC format to include the personal path component in another place; or exclude the personal path component entirely. Consultthe output of the <b>-D?</b> option for the environment variables name and the HASPERSDC format specification."},{"id": 18642,"commandid" : 2462,"title": "Diagnostics","page": "Errors are identified with messages on the standard error file.<br><br>Lsof returns a one (1) if any error was detected, including the failure to locate command names, file names, Internet addresses or files,login names, NFS files, PIDs, PGIDs, or UIDs it was asked to list. If the <b>-V</b> option is specified, lsof will indicate the search items it failedto list.<br><br>It returns a zero (0) if no errors were detected and if it was able to list some information about all the specified search arguments.<br><br>When lsof cannot open access to /dev (or /devices) or one of its subdirectories, or get information on a file in them with<b><a href=/man/2/stat rel=nofollow>stat</a></b>(2), it issues a warning message and continues. That lsof will issue warning messages about inaccessible files in /dev (or/devices) is indicated in its help output - requested with the <b>-h</b> or &gt;B -? options - with the message:   -w option. It may also have been suppressed by the system administrator when "},{"id": 18643,"commandid" : 2462,"title": "Examples","page": "For a more extensive set of examples, documented more fully, see the <br><br>To list all open files, use:<br><br>To list all open Internet, x.25 (HP-UX), and UNIX domain files, use:<br><br>To list all open IPv4 network files in use by the process whose PID is 1234, use:<br><br>Presuming the UNIX dialect supports IPv6, to list only open IPv6 network files, use:<br><br>To list all files using any protocol on ports 513, 514, or 515 of host wonderland.cc.purdue.edu, use:<br><br>To list all files using any protocol on any port of mace.cc.purdue.edu (cc.purdue.edu is the default domain), use:<br><br>To list all open files for login name abe, or user ID 1234, or process 456, or process 123, or process 789, use:<br><br>To list all open files on device /dev/hd4, use:<br><br>To find the process that has /u/abe/foo open, use:<br><br>To send a SIGHUP to the processes that have /u/abe/bar open, use:<br><br>To find any open file, including an open UNIX domain socket file, with the name /dev/log, use:<br><br>To find processes with open files on the NFS file system named /nfs/mount/point whose server is inaccessible, and presuming your mount table suppliesthe device number for /nfs/mount/point, use:<br><br>To do the preceding search with warning messages suppressed, use:<br><br>To ignore the device cache file, use:<br><br>To obtain PID and command name field output for each process, file descriptor, file device number, and file inode number for each file of each process, use:<br><br>To list the files at descriptors 1 and 3 of every process running the lsof command for login ID abe every 10 seconds, use:<br><br>To list the current working directory of processes running a command that is exactly four characters long and has an o or O in character three, use thisregular expression form of the <b>-c</b> c option:<br><br>To find an IP version 4 socket file by its associated numeric dot-form address, use:<br><br>To find an IP version 6 socket file (when the UNIX dialect supports IPv6) by its associated numeric colon-form address, use:<br><br>To find an IP version 6 socket file (when the UNIX dialect supports IPv6) by an associated numeric colon-form address that has a run of zeroes in it - e.g.,the loop-back address - use:<br><br>To obtain a repeat mode marker line that contains the current time, use:<br><br>To add spaces to the previous marker line, use:"},{"id": 18644,"commandid" : 2462,"title": "Bugs","page": "Since <br><br>When a file has multiple record locks, the lock status character (following the file descriptor) is derived from a test of the first lock structure, notfrom any combination of the individual record locks that might be described by multiple lock structures.<br><br>Lsof cant search for files with restrictive access permissions by name unless it is installed with root set-UID permission. Otherwise it islimited to searching for files to which its user or its set-GID group (if any) has access permission.<br><br>The display of the destination address of a raw socket (e.g., for ping) depends on the UNIX operating system. Some dialects store the destinationaddress in the raw sockets protocol control block, some do not.<br><br>Lsof cant always represent Solaris device numbers in the same way that <b><a href=/man/1/ls>ls</a></b>(1) does. For example, the major and minor device numbers that the<b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2) and <b><a href=/man/2/stat rel=nofollow>stat</a></b>(2) functions report for the directory on which CD-ROM files are mounted (typically /cdrom) are not the same as the onesthat it reports for the device on which CD-ROM files are mounted (typically /dev/sr0). (Lsof reports the directory numbers.)<br><br>The support for /proc file systems is available only for BSD and Tru64 UNIX dialects, Linux, and dialects derived from SYSV R4 - e.g., FreeBSD,NetBSD, OpenBSD, Solaris, UnixWare.<br><br>Some /proc file items - device number, inode number, and file size - are unavailable in some dialects. Searching for files in a /proc filesystem may require that the full path name be specified.<br><br>No text (<b>txt</b>) file descriptors are displayed for Linux processes. All entries for files other than the current working directory, the root directory,and numerical file descriptors are labeled <b>mem</b> descriptors.<br><br>Lsof cant search for Tru64 UNIX named pipes by name, because their kernel implementation of <b><a href=/man/2/lstat rel=nofollow>lstat</a></b>(2) returns an improper device number for anamed pipe.<br><br>Lsof cant report fully or correctly on HP-UX 9.01, 10.20, and 11.00 locks because of insufficient access to kernel data or errors in the kerneldata. See the lsof FAQ (The <b>FAQ</b> section gives its location.) for details.<br><br>The AIX SMT file type is a fabrication. Its made up for file structures whose type (15) isnt defined in the AIX <a href=/include/sys/file.h rel=nofollow>/usr/include/sys/file.h</a> headerfile. One way to create such file structures is to run X clients with the DISPLAY variable set to :0.0.<br><br>The <b>+|-f</b>[cfgGn] option is not supported under /proc-based Linux lsof, because it doesnt read kernel structures from kernel memory."},{"id": 18645,"commandid" : 2462,"title": "Environment","page": "defines a language locale. See <b><a href=/man/3/setlocale rel=nofollow>setlocale</a></b>(3) for the names of other variables that can be used in place of LANG - e.g., LC_ALL, LC_TYPE, etc.LSOFDEVCACHEdefines the path to a device cache file. See the <b>DEVICE CACHE PATH FROM AN ENVIRONMENT VARIABLE</b> section for more information.LSOFPERSDCPATHdefines the middle component of a modified personal device cache file path. See the <b>MODIFIED PERSONAL DEVICE CACHE PATH</b> section for moreinformation."},{"id": 18646,"commandid" : 2462,"title": "Faq","page": "Frequently-asked questions and their answers (an FAQ) are available in the <br><br>That file is also available via anonymous ftp from lsof.itap.purdue.edu at pub/tools/unix/lsofFAQ. The URL is:ftp://lsof.itap.purdue.edu/pub/tools/unix/lsof/FAQ"},{"id": 18647,"commandid" : 2463,"title": "Name","page": "<br><br>grep, egrep, fgrep - print lines matching a pattern"},{"id": 18648,"commandid" : 2463,"title": "Synopsis","page": "<br><br><b>grep</b> [OPTIONS] PATTERN [FILE...]<b><br>grep</b> [OPTIONS] [<b>-e</b> PATTERN | <b>-f</b> FILE] [FILE...]"},{"id": 18649,"commandid" : 2463,"title": "Description","page": "<br><br><b>grep</b> searches the named input FILEs (or standard input if no files are named, or if a single hyphen-minus (<b>-</b>) is given as file name)for lines containing a match to the given PATTERN. By default, <b>grep</b> prints the matching lines.<br><br>In addition, two variant programs <b>egrep</b> and <b>fgrep</b> are available. <b>egrep</b> is the same as <b>grep -E</b>. <b>fgrep</b> is the same as<b>grep -F</b>. Direct invocation as either <b>egrep</b> or <b>fgrep</b> is deprecated, but is provided to allow historical applications that rely on them torun unmodified."},{"id": 18650,"commandid" : 2463,"title": "Options","page": "<br><br><b>Generic Program Information</b>--help<br><br>Print a usage message briefly summarizing these command-line options and the bug-reporting address, then exit.-V, --versionPrint the version number of <b>grep</b> to the standard output stream. This version number should be included in all bug reports (see below).<br><br><b>Matcher Selection</b>-E, --extended-regexpInterpret PATTERN as an extended regular expression (ERE, see below). (<b>-E</b> is specified by POSIX .)-F, --fixed-stringsInterpret PATTERN as a list of fixed strings, separated by newlines, any of which is to be matched. (<b>-F</b> is specified by POSIX.)-G, --basic-regexpInterpret PATTERN as a basic regular expression (BRE, see below). This is the default.-P, --perl-regexpInterpret PATTERN as a Perl regular expression. This is highly experimental and <b>grep -P</b> may warn of unimplemented features.<br><br><b>Matching Control</b>-e --regexp=PATTERNUse PATTERN as the pattern. This can be used to specify multiple search patterns, or to protect a pattern beginning with a hyphen (<b>-</b>).(<b>-e</b> is specified by POSIX .)-f --file=FILEObtain patterns from FILE, one per line. The empty file contains zero patterns, and therefore matches nothing. (<b>-f</b> is specified byPOSIX .)-i, --ignore-caseIgnore case distinctions in both the PATTERN and the input files. (<b>-i</b> is specified by POSIX .)-v, --invert-matchInvert the sense of matching, to select non-matching lines. (<b>-v</b> is specified by POSIX .)-w, --word-regexpSelect only those lines containing matches that form whole words. The test is that the matching substring must either be at the beginning of the line, orpreceded by a non-word constituent character. Similarly, it must be either at the end of the line or followed by a non-word constituent character.Word-constituent characters are letters, digits, and the underscore.-x, --line-regexpSelect only those matches that exactly match the whole line. (<b>-x</b> is specified by POSIX .)-y<br><br>Obsolete synonym for <b>-i</b>.<br><br><b>General Output Control</b>-c, --countSuppress normal output; instead print a count of matching lines for each input file. With the <b>-v</b>, <b>--invert-match</b> option (see below), countnon-matching lines. (<b>-c</b> is specified by POSIX .)--color[=WHEN--colour[=WHENSurround the matched (non-empty) strings, matching lines, context lines, file names, line numbers, byte offsets, and separators (for fields and groups ofcontext lines) with escape sequences to display them in color on the terminal. The colors are defined by the environment variable <b>GREP_COLORS</b>. Thedeprecated environment variable <b>GREP_COLOR</b> is still supported, but its setting does not have priority. WHEN is <b>never</b>, <b>always</b>, or<b>auto</b>.-L, --files-without-matchSuppress normal output; instead print the name of each input file from which no output would normally have been printed. The scanning will stop on the firstmatch.-l, --files-with-matchesSuppress normal output; instead print the name of each input file from which output would normally have been printed. The scanning will stop on the firstmatch. (<b>-l</b> is specified by POSIX .)-m --max-count=NUMStop reading a file after NUM matching lines. If the input is standard input from a regular file, and NUM matching lines are output,<b>grep</b> ensures that the standard input is positioned to just after the last matching line before exiting, regardless of the presence of trailing contextlines. This enables a calling process to resume a search. When <b>grep</b> stops after NUM matching lines, it outputs any trailing context lines. Whenthe <b>-c</b> or <b>--count</b> option is also used, <b>grep</b> does not output a count greater than NUM. When the <b>-v</b> or <b>--invert-match</b>option is also used, <b>grep</b> stops after outputting NUM non-matching lines.-o, --only-matchingPrint only the matched (non-empty) parts of a matching line, with each such part on a separate output line.-q, --quiet, --silentQuiet; do not write anything to standard output. Exit immediately with zero status if any match is found, even if an error was detected. Also see the<b>-s</b> or <b>--no-messages</b> option. (<b>-q</b> is specified by POSIX .)-s, --no-messagesSuppress error messages about nonexistent or unreadable files. Portability note: unlike GNU <b>grep</b>, 7th Edition Unix <b>grep</b> did notconform to POSIX , because it lacked <b>-q</b> and its <b>-s</b> option behaved like GNU <b>grep</b>s <b>-q</b> option.USG -style <b>grep</b> also lacked <b>-q</b> but its <b>-s</b> option behaved like GNU <b>grep</b>. Portable shell scripts shouldavoid both <b>-q</b> and <b>-s</b> and should redirect standard and error output to <b>/dev/null</b> instead. (<b>-s</b> is specified by POSIX.)<br><br><b>Output Line Prefix Control</b>-b, --byte-offsetPrint the 0-based byte offset within the input file before each line of output. If <b>-o</b> (<b>--only-matching</b>) is specified, print the offset of thematching part itself.-H, --with-filenamePrint the file name for each match. This is the default when there is more than one file to search.-h, --no-filenameSuppress the prefixing of file names on output. This is the default when there is only one file (or only standard input) to search.--label=LABELDisplay input actually coming from standard input as input coming from file LABEL. This is especially useful when implementing tools like<b>zgrep</b>, e.g., <b>gzip -cd foo.gz | grep --label=foo -H something</b>. See also the <b>-H</b> option.-n, --line-numberPrefix each line of output with the 1-based line number within its input file. (<b>-n</b> is specified by POSIX .)-T, --initial-tabMake sure that the first character of actual line content lies on a tab stop, so that the alignment of tabs looks normal. This is useful with options thatprefix their output to the actual content: <b>-H</b>,<b>-n</b>, and <b>-b</b>. In order to improve the probability that lines from a single file will all startat the same column, this also causes the line number and byte offset (if present) to be printed in a minimum size field width.-u, --unix-byte-offsetsReport Unix-style byte offsets. This switch causes <b>grep</b> to report byte offsets as if the file were a Unix-style text file, i.e., with CR charactersstripped off. This will produce results identical to running <b>grep</b> on a Unix machine. This option has no effect unless <b>-b</b> option is also used; ithas no effect on platforms other than MS-DOS and MS -Windows.-Z, --nullOutput a zero byte (the ASCII <b>NUL</b> character) instead of the character that normally follows a file name. For example, <b>grep -lZ</b>outputs a zero byte after each file name instead of the usual newline. This option makes the output unambiguous, even in the presence of file names containingunusual characters like newlines. This option can be used with commands like <b>find -print0</b>, <b>perl -0</b>, <b>sort -z</b>, and <b>xargs -0</b> toprocess arbitrary file names, even those that contain newline characters.<br><br><b>Context Line Control</b>-A --after-context=NUMPrint NUM lines of trailing context after matching lines. Places a line containing a group separator (<b>--</b>) between contiguous groups ofmatches. With the <b>-o</b> or <b>--only-matching</b> option, this has no effect and a warning is given.-B --before-context=NUMPrint NUM lines of leading context before matching lines. Places a line containing a group separator (<b>--</b>) between contiguous groups ofmatches. With the <b>-o</b> or <b>--only-matching</b> option, this has no effect and a warning is given.-C -NUM--context=NUMPrint NUM lines of output context. Places a line containing a group separator (<b>--</b>) between contiguous groups of matches. With the <b>-o</b> or<b>--only-matching</b> option, this has no effect and a warning is given.<br><br><b>File and Directory Selection</b>-a, --textProcess a binary file as if it were text; this is equivalent to the <b>--binary-files=text</b> option.--binary-files=TYPEIf the first few bytes of a file indicate that the file contains binary data, assume that the file is of type TYPE. By default, TYPE is<b>binary</b>, and <b>grep</b> normally outputs either a one-line message saying that a binary file matches, or no message if there is no match. If TYPEis <b>without-match</b>, <b>grep</b> assumes that a binary file does not match; this is equivalent to the <b>-I</b> option. If TYPE is <b>text</b>,<b>grep</b> processes a binary file as if it were text; this is equivalent to the <b>-a</b> option. Warning: <b>grep --binary-files=text</b> mightoutput binary garbage, which can have nasty side effects if the output is a terminal and if the terminal driver interprets some of it as commands.-D --devices=ACTIONIf an input file is a device, FIFO or socket, use ACTION to process it. By default, ACTION is <b>read</b>, which means that devices are readjust as if they were ordinary files. If ACTION is <b>skip</b>, devices are silently skipped.-d --directories=ACTIONIf an input file is a directory, use ACTION to process it. By default, ACTION is <b>read</b>, which means that directories are read just as ifthey were ordinary files. If ACTION is <b>skip</b>, directories are silently skipped. If ACTION is <b>recurse</b>, <b>grep</b> reads all filesunder each directory, recursively; this is equivalent to the <b>-r</b> option.--exclude=GLOBSkip files whose base name matches GLOB (using wildcard matching). A file-name glob can use <b>*</b>, <b>?</b>, and <b>[</b>...<b>]</b> as wildcards,and <b></b> to quote a wildcard or backslash character literally.--exclude-from=FILESkip files whose base name matches any of the file-name globs read from FILE (using wildcard matching as described under <b>--exclude</b>).--exclude-dir=DIRExclude directories matching the pattern DIR from recursive searches.-I<br><br>Process a binary file as if it did not contain matching data; this is equivalent to the <b>--binary-files=without-match</b> option.--include=GLOBSearch only files whose base name matches GLOB (using wildcard matching as described under <b>--exclude</b>).-R, -r, --recursiveRead all files under each directory, recursively; this is equivalent to the <b>-d recurse</b> option.<br><br><b>Other Options</b>--line-bufferedUse line buffering on output. This can cause a performance penalty.--mmap<br><br>If possible, use the <b><a href=/man/2/mmap rel=nofollow>mmap</a></b>(2) system call to read input, instead of the default <b><a href=/man/2/read rel=nofollow>read</a></b>(2) system call. In some situations, <b>--mmap</b> yieldsbetter performance. However, <b>--mmap</b> can cause undefined behavior (including core dumps) if an input file shrinks while <b>grep</b> is operating, or ifan I/O error occurs.-U, --binaryTreat the <b>file</b>(s) as binary. By default, under MS-DOS and MS -Windows, <b>grep</b> guesses the file type by looking at thecontents of the first 32KB read from the file. If <b>grep</b> decides the file is a text file, it strips the CR characters from the original file contents (tomake regular expressions with <b>^</b> and <b>$</b> work correctly). Specifying <b>-U</b> overrules this guesswork, causing all files to be read and passed tothe matching mechanism verbatim; if the file is a text file with CR/LF pairs at the end of each line, this will cause some regular expressions to fail. Thisoption has no effect on platforms other than MS-DOS and MS -Windows.-z, --null-dataTreat the input as a set of lines, each terminated by a zero byte (the ASCII <b>NUL</b> character) instead of a newline. Like the <b>-Z</b>or <b>--null</b> option, this option can be used with commands like <b>sort -z</b> to process arbitrary file names."},{"id": 18651,"commandid" : 2463,"title": "Regular Expressions","page": "<br><br>A regular expression is a pattern that describes a set of strings. Regular expressions are constructed analogously to arithmetic expressions, by usingvarious operators to combine smaller expressions.<br><br><b>grep</b> understands three different versions of regular expression syntax: basic, extended and perl. In GNU <b>grep</b>, there isno difference in available functionality between basic and extended syntaxes. In other implementations, basic regular expressions are less powerful. Thefollowing description applies to extended regular expressions; differences for basic regular expressions are summarized afterwards. Perl regular expressionsgive additional functionality, and are documented in <b><a href=/man/3/pcresyntax>pcresyntax</a></b>(3) and <b><a href=/man/3/pcrepattern>pcrepattern</a></b>(3), but may not be available on every system.<br><br>The fundamental building blocks are the regular expressions that match a single character. Most characters, including all letters and digits, are regularexpressions that match themselves. Any meta-character with special meaning may be quoted by preceding it with a backslash.<br><br>The period <b>.</b> matches any single character.<br><br><b>Character Classes and Bracket Expressions</b>[ and ]. It matches any single character in that list; if the first characterof the list is the caret ^ then it matches any character [0123456789] matches anysingle digit.<br><br>Within a bracket expression, a range expression consists of two characters separated by a hyphen. It matches any single character that sorts betweenthe two characters, inclusive, using the locales collating sequence and character set. For example, in the default C locale, <b>[a-d]</b> is equivalent to<b>[abcd]</b>. Many locales sort characters in dictionary order, and in these locales <b>[a-d]</b> is typically not equivalent to <b>[abcd]</b>; it might beequivalent to <b>[aBbCcDd]</b>, for example. To obtain the traditional interpretation of bracket expressions, you can use the C locale by setting the<b>LC_ALL</b> environment variable to the value <b>C</b>.<br><br>Finally, certain named classes of characters are predefined within bracket expressions, as follows. Their names are self explanatory, and they are<b>[:alnum:]</b>, <b>[:alpha:]</b>, <b>[:cntrl:]</b>, <b>[:digit:]</b>, <b>[:graph:]</b>, <b>[:lower:]</b>, <b>[:print:]</b>, <b>[:punct:]</b>,<b>[:space:]</b>, <b>[:upper:]</b>, and <b>[:xdigit:].</b> For example, <b>[[:alnum:]]</b> means <b>[0-9A-Za-z]</b>, except the latter form depends upon the Clocale and the ASCII character encoding, whereas the former is independent of locale and character set. (Note that the brackets in these classnames are part of the symbolic names, and must be included in addition to the brackets delimiting the bracket expression.) Most meta-characters lose theirspecial meaning inside bracket expressions. To include a literal <b>]</b> place it first in the list. Similarly, to include a literal <b>^</b> place itanywhere but first. Finally, to include a literal <b>-</b> place it last.<br><br><b>Anchoring</b>^ and the dollar sign $ are meta-characters that respectively match the empty string at the beginning and end of a line.<br><br><b>The Backslash Character and Special Expressions</b>&lt; and &gt; respectively match the empty string at the beginning and end of a word. The symbol b matches the emptystring at the edge of a word, and B matches the empty string provided its w is a synonym for[[:alnum:]] and W is a synonym for [^[:alnum:]].<br><br><b>Repetition</b>?<br><br>The preceding item is optional and matched at most once.<br><br><b>*</b><br><br>The preceding item will be matched zero or more times.<br><br><b>+</b><br><br>The preceding item will be matched one or more times.<br><br><b>{</b>n<b>}</b><br><br>The preceding item is matched exactly n times.<br><br><b>{</b>n<b>,}</b><br><br>The preceding item is matched n or more times.<br><br><b>{,</b>m<b>}</b><br><br>The preceding item is matched at most m times.<br><br><b>{</b>n<b>,</b>m<b>}</b><br><br>The preceding item is matched at least n times, but not more than m times.<br><br><b>Concatenation</b><br><br><b>Alternation</b>|; the resulting regular expression matches any string matching either alternateexpression.<br><br><b>Precedence</b><br><br><b>Back References and Subexpressions</b>n<br><br><b>Basic vs Extended Regular Expressions</b>?, +, {, |, (, and ) lose their special meaning; instead use thebackslashed versions ?, +, {, |, (, and ).<br><br>Traditional <b>egrep</b> did not support the <b>{</b> meta-character, and some <b>egrep</b> implementations support <b>{</b> instead, so portable scriptsshould avoid <b>{</b> in <b>grep -E</b> patterns and should use <b>[{]</b> to match a literal <b>{</b>.<br><br>GNU <b>grep -E</b> attempts to support traditional usage by assuming that <b>{</b> is not special if it would be the start of an invalidinterval specification. For example, the command <b>grep -E {1</b> searches for the two-character string <b>{1</b> instead of reporting a syntax error in theregular expression. POSIX.2 allows this behavior as an extension, but portable scripts should avoid it."},{"id": 18652,"commandid" : 2463,"title": "Environment Variables","page": "<br><br>The behavior of <b>grep</b> is affected by the following environment variables.<br><br>The locale for category <b>LC_</b>foo is specified by examining the three environment variables <b>LC_ALL</b>, <b>LC_</b>foo, <b>LANG</b>, inthat order. The first of these variables that is set specifies the locale. For example, if <b>LC_ALL</b> is not set, but <b>LC_MESSAGES</b> is set to<b>pt_BR</b>, then the Brazilian Portuguese locale is used for the <b>LC_MESSAGES</b> category. The C locale is used if none of these environment variables areset, if the locale catalog is not installed, or if <b>grep</b> was not compiled with national language support ( NLS ).GREP_OPTIONSThis variable specifies default options to be placed in front of any explicit options. For example, if <b>GREP_OPTIONS</b> is<b>--binary-files=without-match --directories=skip</b>, <b>grep</b> behaves as if the two options <b>--binary-files=without-match</b> and<b>--directories=skip</b> had been specified before any explicit options. Option specifications are separated by whitespace. A backslash escapes the nextcharacter, so it can be used to specify an option containing whitespace or a backslash.GREP_COLORThis variable specifies the color used to highlight matched (non-empty) text. It is deprecated in favor of <b>GREP_COLORS</b>, but still supported. The<b>mt</b>, <b>ms</b>, and <b>mc</b> capabilities of <b>GREP_COLORS</b> have priority over it. It can only specify the color used to highlight the matchingnon-empty text in any matching line (a selected line when the <b>-v</b> command-line option is omitted, or a context line when <b>-v</b> is specified). Thedefault is <b>01;31</b>, which means a bold red foreground text on the terminals default background.GREP_COLORSSpecifies the colors and other attributes used to highlight various parts of the output. Its value is a colon-separated list of capabilities that defaultsto <b>ms=01;31:mc=01;31:sl=:cx=:fn=35:ln=32:bn=32:se=36</b> with the <b>rv</b> and <b>ne</b> boolean capabilities omitted (i.e., false). Supported capabilitiesare as follows.<b>sl=</b><p>SGR substring for whole selected lines (i.e., matching lines when the <b>-v</b> command-line option is omitted, or non-matching lines when <b>-v</b> isspecified). If however the boolean <b>rv</b> capability and the <b>-v</b> command-line option are both specified, it applies to context matching lines instead.The default is empty (i.e., the terminals default color pair).</p><p><b>cx=</b></p><p>SGR substring for whole context lines (i.e., non-matching lines when the <b>-v</b> command-line option is omitted, or matching lines when <b>-v</b> isspecified). If however the boolean <b>rv</b> capability and the <b>-v</b> command-line option are both specified, it applies to selected non-matching linesinstead. The default is empty (i.e., the terminals default color pair).</p><p><b>rv</b></p><p>Boolean value that reverses (swaps) the meanings of the <b>sl=</b> and <b>cx=</b> capabilities when the <b>-v</b> command-line option is specified. Thedefault is false (i.e., the capability is omitted).</p><b>mt=01;31</b><br><br>SGR substring for matching non-empty text in any matching line (i.e., a selected line when the <b>-v</b> command-line option is omitted, or a context linewhen <b>-v</b> is specified). Setting this is equivalent to setting both <b>ms=</b> and <b>mc=</b> at once to the same value. The default is a bold red textforeground over the current line background.<b>ms=01;31</b><br><br>SGR substring for matching non-empty text in a selected line. (This is only used when the <b>-v</b> command-line option is omitted.) The effect of the<b>sl=</b> (or <b>cx=</b> if <b>rv</b>) capability remains active when this kicks in. The default is a bold red text foreground over the current linebackground.<b>mc=01;31</b><br><br>SGR substring for matching non-empty text in a context line. (This is only used when the <b>-v</b> command-line option is specified.) The effect of the<b>cx=</b> (or <b>sl=</b> if <b>rv</b>) capability remains active when this kicks in. The default is a bold red text foreground over the current linebackground.<b>fn=35</b><p>SGR substring for file names prefixing any content line. The default is a magenta text foreground over the terminals default background.</p><p><b>ln=32</b></p><p>SGR substring for line numbers prefixing any content line. The default is a green text foreground over the terminals default background.</p><p><b>bn=32</b></p><p>SGR substring for byte offsets prefixing any content line. The default is a green text foreground over the terminals default background.</p><p><b>se=36</b></p><p>SGR substring for separators that are inserted between selected line fields (<b>:</b>), between context line fields, (<b>-</b>), and between groups ofadjacent lines when nonzero context is specified (<b>--</b>). The default is a cyan text foreground over the terminals default background.</p><p><b>ne</b></p><p>Boolean value that prevents clearing to the end of line using Erase in Line (EL) to Right (<b>33[K</b>) each time a colorized item ends. This is needed onterminals on which EL is not supported. It is otherwise useful on terminals for which the <b>back_color_erase</b> (<b>bce</b>) boolean terminfo capability doesnot apply, when the chosen highlight colors do not affect the background, or when EL is too slow or causes too much flicker. The default is false (i.e., thecapability is omitted).</p>Note that boolean capabilities have no <b>=</b>... part. They are omitted (i.e., false) by default and become true when specified.<p>See the Select Graphic Rendition (SGR) section in the documentation of the text terminal that is used for permitted values and their meaning as characterattributes. These substring values are integers in decimal representation and can be concatenated with semicolons. <b>grep</b> takes care of assembling theresult into a complete SGR sequence (<b>33[</b>...<b>m</b>). Common values to concatenate include <b>1</b> for bold, <b>4</b> for underline, <b>5</b> forblink, <b>7</b> for inverse, <b>39</b> for default foreground color, <b>30</b> to <b>37</b> for foreground colors, <b>90</b> to <b>97</b> for 16-color modeforeground colors, <b>38;5;0</b> to <b>38;5;255</b> for 88-color and 256-color modes foreground colors, <b>49</b> for default background color, <b>40</b> to<b>47</b> for background colors, <b>100</b> to <b>107</b> for 16-color mode background colors, and <b>48;5;0</b> to <b>48;5;255</b> for 88-color and 256-colormodes background colors.</p>LC_ALL, LC_COLLATE, LANGThese variables specify the locale for the <b>LC_COLLATE</b> category, which determines the collating sequence used to interpret range expressions like<b>[a-z]</b>.LC_ALL, LC_CTYPE, LANGThese variables specify the locale for the <b>LC_CTYPE</b> category, which determines the type of characters, e.g., which characters are whitespace.LC_ALL, LC_MESSAGES, LANGThese variables specify the locale for the <b>LC_MESSAGES</b> category, which determines the language that <b>grep</b> uses for messages. The default Clocale uses American English messages.POSIXLY_CORRECTIf set, <b>grep</b> behaves as POSIX.2 requires; otherwise, <b>grep</b> behaves more like other GNU programs.POSIX.2 requires that options that follow file names must be treated as file names; by default, such options are permuted to the front of theoperand list and are treated as options. Also, POSIX.2 requires that unrecognized options be diagnosed as illegal, but since they are notreally against the law the default is to diagnose them as invalid. <b>POSIXLY_CORRECT</b> also disables <b>_</b>N<b>_GNU_nonoption_argv_flags_</b>,described below._N_GNU_nonoption_argv_flags_(Here N is <b>grep</b>s numeric process ID.) If the ith character of this environment variables value is <b>1</b>, do not consider theith operand of <b>grep</b> to be an option, even if it appears to be one. A shell can put this variable in the environment for each command it runs,specifying which operands are the results of file name wildcard expansion and therefore should not be treated as options. This behavior is available only withthe GNU C library, and only when <b>POSIXLY_CORRECT</b> is not set."},{"id": 18653,"commandid" : 2463,"title": "Exit Status","page": "<br><br>Normally, the exit status is 0 if selected lines are found and 1 otherwise. But the exit status is 2 if an error occurred, unless the <b>-q</b> or<b>--quiet</b> or <b>--silent</b> option is used and a selected line is found. Note, however, that POSIX only mandates, for programs such as<b>grep</b>, <b>cmp</b>, and <b>diff</b>, that the exit status in case of error be greater than 1; it is therefore advisable, for the sake of portability, touse logic that tests for this general condition instead of strict equality with 2."},{"id": 18654,"commandid" : 2463,"title": "Copyright","page": "<br><br>Copyright 1998-2000, 2002, 2005-2010 Free Software Foundation, Inc.<br><br>This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULARPURPOSE."},{"id": 18655,"commandid" : 2463,"title": "Bugs","page": "<br><br><b>Reporting Bugs</b><a href=mailto:bug-grep@gnu.org>bug-grep@gnu.org</a>>, a mailing list whose web page is <<a href=http://lists.gnu.org/mailman/listinfo/bug-grep>http://lists.gnu.org/mailman/listinfo/bug-grep</a>>.greps Savannah bug tracker is located at <<a href=http://savannah.gnu.org/bugs/?group=grep>http://savannah.gnu.org/bugs/?group=grep</a>>.<br><br><b>Known Bugs</b>{n,m} construct may cause grep to use lots of memory. In addition, certain otherobscure regular expressions require exponential time and space, and may cause grep to run out of memory.<br><br>Back-references are very slow, and may require exponential time."},{"id": 18656,"commandid" : 2463,"title": "See Also","page": "<br><br><b>Regular Manual Pages</b><a href=awk>awk</a>(1), <a href=cmp>cmp</a>(1), <a href=diff>diff</a>(1), <a href=find>find</a>(1), <a href=gzip>gzip</a>(1), <a href=perl>perl</a>(1), <a href=sed>sed</a>(1), <a href=sort>sort</a>(1), <a href=xargs>xargs</a>(1), <a href=zgrep>zgrep</a>(1), <a href=/man/2/mmap>mmap</a>(2), <a href=/man/2/read>read</a>(2), <a href=/man/3/pcre>pcre</a>(3), <a href=/man/3/pcresyntax rel=nofollow>pcresyntax</a>(3), <a href=/man/3/pcrepattern rel=nofollow>pcrepattern</a>(3),<a href=/man/5/terminfo>terminfo</a>(5), <a href=/man/7/glob>glob</a>(7), <a href=/man/7/regex>regex</a>(7).<br><br><b>POSIX Programmers Manual Page</b>grep(1p).<br><br><b>TeXinfo Documentation</b>grep is maintained as a TeXinfo manual. If the info and grep programs are properly installed at your site,the command<b>info grep</b>should give you access to the complete manual."},{"id": 18657,"commandid" : 2463,"title": "Notes","page": "<br><br>GNU s not Unix, but Unix is a beast; its plural form is Unixen.<!-- google_ad_section_end -->"},{"id": 18658,"commandid" : 2463,"title": "Referenced By","page": "<a href=bzgrep rel=nofollow>bzgrep</a>(1),<a href=ctags rel=nofollow>ctags</a>(1),<a href=/man/8/dictd rel=nofollow>dictd</a>(8),<a href=ding rel=nofollow>ding</a>(1),<a href=kibitz rel=nofollow>kibitz</a>(1),<a href=ksh93 rel=nofollow>ksh93</a>(1),<a href=lftp rel=nofollow>lftp</a>(1),<a href=mawk rel=nofollow>mawk</a>(1),<a href=mc rel=nofollow>mc</a>(1),<a href=mtnopt rel=nofollow>mtnopt</a>(1),<a href=nvi rel=nofollow>nvi</a>(1),<a href=op rel=nofollow>op</a>(1),<a href=perlfaq6 rel=nofollow>perlfaq6</a>(1),<a href=pmchart rel=nofollow>pmchart</a>(1),<a href=pmie rel=nofollow>pmie</a>(1),<a href=pmie_daily rel=nofollow>pmie_daily</a>(1),<a href=pmlogger_daily rel=nofollow>pmlogger_daily</a>(1),<a href=pmsnap rel=nofollow>pmsnap</a>(1),<a href=procmail rel=nofollow>procmail</a>(1),<a href=/man/5/procmailex rel=nofollow>procmailex</a>(5),<a href=/man/5/procmailrc rel=nofollow>procmailrc</a>(5),<a href=/man/5/procmailsc rel=nofollow>procmailsc</a>(5),<a href=/man/8/tftpd rel=nofollow>tftpd</a>(8),<a href=unzipsfx rel=nofollow>unzipsfx</a>(1),<a href=xzgrep rel=nofollow>xzgrep</a>(1),<a href=zipgrep rel=nofollow>zipgrep</a>(1),<a href=zipinfo rel=nofollow>zipinfo</a>(1)"},{"id": 18659,"commandid" : 2464,"title": "Name","page": "<br><br>pico - simple text editor in the style of the Alpine Composer"},{"id": 18660,"commandid" : 2464,"title": "Syntax","page": "<br><br><b>pico</b> [ options ] [ file ]"},{"id": 18661,"commandid" : 2464,"title": "Description","page": "<br><br>Pico is a simple, display-oriented text editor based on the Alpine message system composer. As with Alpine, commands are displayed at the bottom ofthe screen, and context-sensitive help is provided. As characters are typed they are immediately inserted into the text.<br><br>Editing commands are entered using control-key combinations. As a work-around for communications programs that swallow certain control characters, you canemulate a control key by pressing ESCAPE twice, followed by the desired control character, e.g. ESC ESC c would be equivalent to entering a ctrl-c. Theeditor has five basic features: paragraph justification, searching, block cut/paste, a spelling checker, and a file browser.<br><br>Paragraph justification (or filling) takes place in the paragraph that contains the cursor, or, if the cursor is between lines, in the paragraph immediatelybelow. Paragraphs are delimited by blank lines, or by lines beginning with a space or tab. Unjustification can be done immediately after justification usingthe control-U key combination.<br><br>String searches are not sensitive to case. A search begins at the current cursor position and wraps around the end of the text. The most recent searchstring is offered as the default in subsequent searches.<br><br>Blocks of text can be moved, copied or deleted with creative use of the command for mark (ctrl-^), delete (ctrl-k) and undelete (ctrl-u). The delete commandwill remove text between the mark and the current cursor position, and place it in the cut buffer. The undelete command effects a paste at the currentcursor position.<br><br>The spell checker examines all words in the text. It then offers, in turn, each misspelled word for correction while highlighting it in the text. Spellchecking can be cancelled at any time. Alternatively, pico will substitute for the default spell checking routine a routine defined by the SPELLenvironment variable. The replacement routine should read standard input and write standard output.<br><br>The file browser is offered as an option in the Read File and Write Out command prompts. It is intended to help in searching for specific files andnavigating directory hierarchies. Filenames with sizes and names of directories in the current working directory are presented for selection. The currentworking directory is displayed on the top line of the display while the list of available commands takes up the bottom two. Several basic file manipulationfunctions are supported: file renaming, copying, and deletion.<br><br>More specific help is available in picos online help."},{"id": 18662,"commandid" : 2464,"title": "Options","page": "+n<br><br>Causes pico to be started with the cursor located n lines into the file. (Note: no space between + sign and number)<br><br><b>-a</b><br><br>Display all files including those beginning with a period (.).<br><br><b>-b</b><br><br>Enable the option to Replace text matches found using the Where is command. This now does nothing. Instead, the option is always turned on (as if the -bflag had been specified).<br><br><b>-d</b><br><br>Rebind the delete key so the character the cursor is on is rubbed out rather than the character to its left.<br><br><b>-e</b><br><br>Enable file name completion.<br><br><b>-f</b><br><br>Use function keys for commands. This option supported only in conjunction with UW Enhanced NCSA telnet.<br><br><b>-h</b><br><br>List valid command line options.<br><br><b>-j</b><br><br>Enable Goto command in the file browser. This enables the command to permit explicitly telling pilot which directory to visit.<br><br><b>-g</b><br><br>Enable Show Cursor mode in file browser. Cause cursor to be positioned before the current selection rather than placed at the lower left of the display.<br><br><b>-k</b><br><br>Causes Cut Text command to remove characters from the cursor position to the end of the line rather than remove the entire line.<br><br><b>-m</b><br><br>Enable mouse functionality. This only works when pico is run from within an X Window System xterm window.<br><br><b>-n</b>n<br><br>The -nn option enables new mail notification. The n argument is optional, and specifies how often, in seconds, your mailbox is checked for newmail. For example, -n60 causes pico to check for new mail once every minute. The default interval is 180 seconds, while the minimum allowed is 30.(Note: no space between n and the number)<br><br><b>-o</b> dir<br><br>Sets operating directory. Only files within this directory are accessible. Likewise, the file browser is limited to the specified directory subtree.<br><br><b>-r</b>n<br><br>Sets column used to limit the Justify commands right margin-s Specify an alternate program spell to use when spell checking.-t<br><br>Enable tool mode. Intended for when pico is used as the editor within other tools (e.g., Elm, Pnews). Pico will not prompt for save on exit,and will not rename the buffer during the Write Out command.<br><br><b>-v</b><br><br>View the file only, disallowing any editing.-versionPrint Pico version and exit.-w<br><br>Disable word wrap (thus allow editing of long lines).<br><br><b>-x</b><br><br>Disable keymenu at the bottom of the screen.<br><br><b>-z</b><br><br>Enable ^Z suspension of pico.<br><br><b>-p</b><br><br>Preserve the start and stop characters, typically Ctrl-Q and Ctrl-S, which are sometimes used in communications paths to control data flow betweendevices that operate at different speeds.-Q Set the quote string. Especially useful when composing email, setting this allows the quote string to be checked for when Justifying paragraphs. A commonquote string is &gt; .-W If characters listed here appear in the middle of a word surrounded by alphanumeric characters that word is split into two words. This is used by theForward and Backward word commands and by the spell checker.-q<br><br>Termcap or terminfo definition for input escape sequences are used in preference to sequences defined by default. This option is only available ifpico was compiled with the TERMCAP_WINS define turned on.-setlocale_ctypeDo setlocale(LC_CTYPE) if available. Default is to not do this setlocale.-no_setlocale_collateDo not do setlocale(LC_COLLATE). Default is to do this setlocale.Lastly, when a running "},{"id": 18663,"commandid" : 2464,"title": "Bugs","page": "<br><br>The manner in which lines longer than the display width are dealt is not immediately obvious. Lines that continue beyond the edge of the display areindicated by a $ character at the end of the line. Long lines are scrolled horizontally as the cursor moves through them."},{"id": 18664,"commandid" : 2464,"title": "Files","page": "<br><br>Unnamed interrupted work saved here.<br><br>*.save<br><br>Interrupted work on a named file is saved here."},{"id": 18665,"commandid" : 2464,"title": "Authors","page": "<br><br>Michael Seibel &lt;<a href=mailto:mikes@cac.washington.edu>mikes@cac.washington.edu</a>&gt;<br>Laurence Lundblade &lt;<a href=mailto:lgl@cac.washington.edu>lgl@cac.washington.edu</a>&gt;<br>Pico was originally derived from MicroEmacs 3.6, by Dave G. Conroy.<br>Copyright 1989-2008 by the University of Washington."},{"id": 18666,"commandid" : 2464,"title": "See Also","page": "<br><br><b><a href=alpine>alpine</a></b>(1)<br>Source distribution (part of the Alpine Message System):$Date: 2009-02-02 20:54:23 +0100 (pon, 02 feb 2009) $"},{"id": 18667,"commandid" : 2464,"title": "Referenced By","page": "<a href=pine rel=nofollow>pine</a>(1)"}]